           02  OPNMONP    PICTURE X.
           02  OPNMONH    PICTURE X.
           02  OPNMONV    PICTURE X.
           02  OPNMONO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  OPNDAYC    PICTURE X.
           02  OPNDAYP    PICTURE X.
           02  OPNDAYH    PICTURE X.
           02  OPNDAYV    PICTURE X.
           02  OPNDAYO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  ACRDLIMC    PICTURE X.
           02  ACRDLIMP    PICTURE X.
           02  ACRDLIMH    PICTURE X.
           02  ACRDLIMV    PICTURE X.
           02  ACRDLIMO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  EXPYEARC    PICTURE X.
           02  EXPYEARP    PICTURE X.
           02  EXPYEARH    PICTURE X.
           02  EXPYEARV    PICTURE X.
           02  EXPYEARO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  EXPMONC    PICTURE X.
           02  EXPMONP    PICTURE X.
           02  EXPMONH    PICTURE X.
           02  EXPMONV    PICTURE X.
           02  EXPMONO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  EXPDAYC    PICTURE X.
           02  EXPDAYP    PICTURE X.
           02  EXPDAYH    PICTURE X.
           02  EXPDAYV    PICTURE X.
           02  EXPDAYO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  ACSHLIMC    PICTURE X.
           02  ACSHLIMP    PICTURE X.
           02  ACSHLIMH    PICTURE X.
           02  ACSHLIMV    PICTURE X.
           02  ACSHLIMO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  RISYEARC    PICTURE X.
           02  RISYEARP    PICTURE X.
           02  RISYEARH    PICTURE X.
           02  RISYEARV    PICTURE X.
           02  RISYEARO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  RISMONC    PICTURE X.
           02  RISMONP    PICTURE X.
           02  RISMONH    PICTURE X.
           02  RISMONV    PICTURE X.
           02  RISMONO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  RISDAYC    PICTURE X.
           02  RISDAYP    PICTURE X.
           02  RISDAYH    PICTURE X.
           02  RISDAYV    PICTURE X.
           02  RISDAYO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  ACURBALC    PICTURE X.
           02  ACURBALP    PICTURE X.
           02  ACURBALH    PICTURE X.
           02  ACURBALV    PICTURE X.
           02  ACURBALO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  ACRCYCRC    PICTURE X.
           02  ACRCYCRP    PICTURE X.
           02  ACRCYCRH    PICTURE X.
           02  ACRCYCRV    PICTURE X.
           02  ACRCYCRO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  AADDGRPC    PICTURE X.
           02  AADDGRPP    PICTURE X.
           02  AADDGRPH    PICTURE X.
           02  AADDGRPV    PICTURE X.
           02  AADDGRPO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ACRCYDBC    PICTURE X.
           02  ACRCYDBP    PICTURE X.
           02  ACRCYDBH    PICTURE X.
           02  ACRCYDBV    PICTURE X.
           02  ACRCYDBO  PIC X(15).
           02  FILLER PICTURE X(3).
           02  ACSTNUMC    PICTURE X.
           02  ACSTNUMP    PICTURE X.
           02  ACSTNUMH    PICTURE X.
           02  ACSTNUMV    PICTURE X.
           02  ACSTNUMO  PIC X(9).
           02  FILLER PICTURE X(3).
           02  ACTSSN1C    PICTURE X.
           02  ACTSSN1P    PICTURE X.
           02  ACTSSN1H    PICTURE X.
           02  ACTSSN1V    PICTURE X.
           02  ACTSSN1O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  ACTSSN2C    PICTURE X.
           02  ACTSSN2P    PICTURE X.
           02  ACTSSN2H    PICTURE X.
           02  ACTSSN2V    PICTURE X.
           02  ACTSSN2O  PIC X(2).
