           02  FILLER   PICTURE X(4).
           02  EXPMONI  PIC X(2).
           02  EXPDAYL    COMP  PIC  S9(4).
           02  EXPDAYF    PICTURE X.
           02  FILLER REDEFINES EXPDAYF.
             03 EXPDAYA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  EXPDAYI  PIC X(2).
           02  ACSHLIML    COMP  PIC  S9(4).
           02  ACSHLIMF    PICTURE X.
           02  FILLER REDEFINES ACSHLIMF.
             03 ACSHLIMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSHLIMI  PIC X(15).
           02  RISYEARL    COMP  PIC  S9(4).
           02  RISYEARF    PICTURE X.
           02  FILLER REDEFINES RISYEARF.
             03 RISYEARA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  RISYEARI  PIC X(4).
           02  RISMONL    COMP  PIC  S9(4).
           02  RISMONF    PICTURE X.
           02  FILLER REDEFINES RISMONF.
             03 RISMONA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  RISMONI  PIC X(2).
           02  RISDAYL    COMP  PIC  S9(4).
           02  RISDAYF    PICTURE X.
           02  FILLER REDEFINES RISDAYF.
             03 RISDAYA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  RISDAYI  PIC X(2).
           02  ACURBALL    COMP  PIC  S9(4).
           02  ACURBALF    PICTURE X.
           02  FILLER REDEFINES ACURBALF.
             03 ACURBALA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACURBALI  PIC X(15).
           02  ACRCYCRL    COMP  PIC  S9(4).
           02  ACRCYCRF    PICTURE X.
           02  FILLER REDEFINES ACRCYCRF.
             03 ACRCYCRA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACRCYCRI  PIC X(15).
           02  AADDGRPL    COMP  PIC  S9(4).
           02  AADDGRPF    PICTURE X.
           02  FILLER REDEFINES AADDGRPF.
             03 AADDGRPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  AADDGRPI  PIC X(10).
           02  ACRCYDBL    COMP  PIC  S9(4).
           02  ACRCYDBF    PICTURE X.
           02  FILLER REDEFINES ACRCYDBF.
             03 ACRCYDBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACRCYDBI  PIC X(15).
           02  ACSTNUML    COMP  PIC  S9(4).
           02  ACSTNUMF    PICTURE X.
           02  FILLER REDEFINES ACSTNUMF.
             03 ACSTNUMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSTNUMI  PIC X(9).
           02  ACTSSN1L    COMP  PIC  S9(4).
           02  ACTSSN1F    PICTURE X.
           02  FILLER REDEFINES ACTSSN1F.
             03 ACTSSN1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTSSN1I  PIC X(3).
           02  ACTSSN2L    COMP  PIC  S9(4).
           02  ACTSSN2F    PICTURE X.
           02  FILLER REDEFINES ACTSSN2F.
             03 ACTSSN2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTSSN2I  PIC X(2).
           02  ACTSSN3L    COMP  PIC  S9(4).
           02  ACTSSN3F    PICTURE X.
           02  FILLER REDEFINES ACTSSN3F.
             03 ACTSSN3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACTSSN3I  PIC X(4).
           02  DOBYEARL    COMP  PIC  S9(4).
           02  DOBYEARF    PICTURE X.
           02  FILLER REDEFINES DOBYEARF.
             03 DOBYEARA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DOBYEARI  PIC X(4).
           02  DOBMONL    COMP  PIC  S9(4).
           02  DOBMONF    PICTURE X.
           02  FILLER REDEFINES DOBMONF.
             03 DOBMONA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DOBMONI  PIC X(2).
           02  DOBDAYL    COMP  PIC  S9(4).
           02  DOBDAYF    PICTURE X.
           02  FILLER REDEFINES DOBDAYF.
             03 DOBDAYA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DOBDAYI  PIC X(2).
           02  ACSTFCOL    COMP  PIC  S9(4).
           02  ACSTFCOF    PICTURE X.
