           02  FILLER REDEFINES ACSTFCOF.
             03 ACSTFCOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSTFCOI  PIC X(3).
           02  ACSFNAML    COMP  PIC  S9(4).
           02  ACSFNAMF    PICTURE X.
           02  FILLER REDEFINES ACSFNAMF.
             03 ACSFNAMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSFNAMI  PIC X(25).
           02  ACSMNAML    COMP  PIC  S9(4).
           02  ACSMNAMF    PICTURE X.
           02  FILLER REDEFINES ACSMNAMF.
             03 ACSMNAMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSMNAMI  PIC X(25).
           02  ACSLNAML    COMP  PIC  S9(4).
           02  ACSLNAMF    PICTURE X.
           02  FILLER REDEFINES ACSLNAMF.
             03 ACSLNAMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSLNAMI  PIC X(25).
           02  ACSADL1L    COMP  PIC  S9(4).
           02  ACSADL1F    PICTURE X.
           02  FILLER REDEFINES ACSADL1F.
             03 ACSADL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSADL1I  PIC X(50).
           02  ACSSTTEL    COMP  PIC  S9(4).
           02  ACSSTTEF    PICTURE X.
           02  FILLER REDEFINES ACSSTTEF.
             03 ACSSTTEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSSTTEI  PIC X(2).
           02  ACSADL2L    COMP  PIC  S9(4).
           02  ACSADL2F    PICTURE X.
           02  FILLER REDEFINES ACSADL2F.
             03 ACSADL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSADL2I  PIC X(50).
           02  ACSZIPCL    COMP  PIC  S9(4).
           02  ACSZIPCF    PICTURE X.
           02  FILLER REDEFINES ACSZIPCF.
             03 ACSZIPCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSZIPCI  PIC X(5).
           02  ACSCITYL    COMP  PIC  S9(4).
           02  ACSCITYF    PICTURE X.
           02  FILLER REDEFINES ACSCITYF.
             03 ACSCITYA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSCITYI  PIC X(50).
           02  ACSCTRYL    COMP  PIC  S9(4).
           02  ACSCTRYF    PICTURE X.
           02  FILLER REDEFINES ACSCTRYF.
             03 ACSCTRYA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSCTRYI  PIC X(3).
           02  ACSPH1AL    COMP  PIC  S9(4).
           02  ACSPH1AF    PICTURE X.
           02  FILLER REDEFINES ACSPH1AF.
             03 ACSPH1AA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSPH1AI  PIC X(3).
           02  ACSPH1BL    COMP  PIC  S9(4).
           02  ACSPH1BF    PICTURE X.
           02  FILLER REDEFINES ACSPH1BF.
             03 ACSPH1BA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSPH1BI  PIC X(3).
           02  ACSPH1CL    COMP  PIC  S9(4).
           02  ACSPH1CF    PICTURE X.
           02  FILLER REDEFINES ACSPH1CF.
             03 ACSPH1CA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSPH1CI  PIC X(4).
           02  ACSGOVTL    COMP  PIC  S9(4).
           02  ACSGOVTF    PICTURE X.
           02  FILLER REDEFINES ACSGOVTF.
             03 ACSGOVTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSGOVTI  PIC X(20).
           02  ACSPH2AL    COMP  PIC  S9(4).
           02  ACSPH2AF    PICTURE X.
           02  FILLER REDEFINES ACSPH2AF.
             03 ACSPH2AA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSPH2AI  PIC X(3).
           02  ACSPH2BL    COMP  PIC  S9(4).
           02  ACSPH2BF    PICTURE X.
           02  FILLER REDEFINES ACSPH2BF.
             03 ACSPH2BA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSPH2BI  PIC X(3).
           02  ACSPH2CL    COMP  PIC  S9(4).
           02  ACSPH2CF    PICTURE X.
           02  FILLER REDEFINES ACSPH2CF.
             03 ACSPH2CA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSPH2CI  PIC X(4).
