           02  ACSPH1CV    PICTURE X.
           02  ACSPH1CO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  ACSGOVTC    PICTURE X.
           02  ACSGOVTP    PICTURE X.
           02  ACSGOVTH    PICTURE X.
           02  ACSGOVTV    PICTURE X.
           02  ACSGOVTO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  ACSPH2AC    PICTURE X.
           02  ACSPH2AP    PICTURE X.
           02  ACSPH2AH    PICTURE X.
           02  ACSPH2AV    PICTURE X.
           02  ACSPH2AO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  ACSPH2BC    PICTURE X.
           02  ACSPH2BP    PICTURE X.
           02  ACSPH2BH    PICTURE X.
           02  ACSPH2BV    PICTURE X.
           02  ACSPH2BO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  ACSPH2CC    PICTURE X.
           02  ACSPH2CP    PICTURE X.
           02  ACSPH2CH    PICTURE X.
           02  ACSPH2CV    PICTURE X.
           02  ACSPH2CO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  ACSEFTCC    PICTURE X.
           02  ACSEFTCP    PICTURE X.
           02  ACSEFTCH    PICTURE X.
           02  ACSEFTCV    PICTURE X.
           02  ACSEFTCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ACSPFLGC    PICTURE X.
           02  ACSPFLGP    PICTURE X.
           02  ACSPFLGH    PICTURE X.
           02  ACSPFLGV    PICTURE X.
           02  ACSPFLGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  INFOMSGC    PICTURE X.
           02  INFOMSGP    PICTURE X.
           02  INFOMSGH    PICTURE X.
           02  INFOMSGV    PICTURE X.
           02  INFOMSGO  PIC X(45).
           02  FILLER PICTURE X(3).
           02  ERRMSGC    PICTURE X.
           02  ERRMSGP    PICTURE X.
           02  ERRMSGH    PICTURE X.
           02  ERRMSGV    PICTURE X.
           02  ERRMSGO  PIC X(78).
           02  FILLER PICTURE X(3).
           02  FKEYSC    PICTURE X.
           02  FKEYSP    PICTURE X.
           02  FKEYSH    PICTURE X.
           02  FKEYSV    PICTURE X.
           02  FKEYSO  PIC X(21).
           02  FILLER PICTURE X(3).
           02  FKEY05C    PICTURE X.
           02  FKEY05P    PICTURE X.
           02  FKEY05H    PICTURE X.
           02  FKEY05V    PICTURE X.
           02  FKEY05O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  FKEY12C    PICTURE X.
           02  FKEY12P    PICTURE X.
           02  FKEY12H    PICTURE X.
           02  FKEY12V    PICTURE X.
           02  FKEY12O  PIC X(10).
