           02  ACSADL2P    PICTURE X.
           02  ACSADL2H    PICTURE X.
           02  ACSADL2V    PICTURE X.
           02  ACSADL2O  PIC X(50).
           02  FILLER PICTURE X(3).
           02  ACSZIPCC    PICTURE X.
           02  ACSZIPCP    PICTURE X.
           02  ACSZIPCH    PICTURE X.
           02  ACSZIPCV    PICTURE X.
           02  ACSZIPCO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  ACSCITYC    PICTURE X.
           02  ACSCITYP    PICTURE X.
           02  ACSCITYH    PICTURE X.
           02  ACSCITYV    PICTURE X.
           02  ACSCITYO  PIC X(50).
           02  FILLER PICTURE X(3).
           02  ACSCTRYC    PICTURE X.
           02  ACSCTRYP    PICTURE X.
           02  ACSCTRYH    PICTURE X.
           02  ACSCTRYV    PICTURE X.
           02  ACSCTRYO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  ACSPHN1C    PICTURE X.
           02  ACSPHN1P    PICTURE X.
           02  ACSPHN1H    PICTURE X.
           02  ACSPHN1V    PICTURE X.
           02  ACSPHN1O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  ACSGOVTC    PICTURE X.
           02  ACSGOVTP    PICTURE X.
           02  ACSGOVTH    PICTURE X.
           02  ACSGOVTV    PICTURE X.
           02  ACSGOVTO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  ACSPHN2C    PICTURE X.
           02  ACSPHN2P    PICTURE X.
           02  ACSPHN2H    PICTURE X.
           02  ACSPHN2V    PICTURE X.
           02  ACSPHN2O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  ACSEFTCC    PICTURE X.
           02  ACSEFTCP    PICTURE X.
           02  ACSEFTCH    PICTURE X.
           02  ACSEFTCV    PICTURE X.
           02  ACSEFTCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ACSPFLGC    PICTURE X.
           02  ACSPFLGP    PICTURE X.
           02  ACSPFLGH    PICTURE X.
           02  ACSPFLGV    PICTURE X.
           02  ACSPFLGO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  INFOMSGC    PICTURE X.
           02  INFOMSGP    PICTURE X.
           02  INFOMSGH    PICTURE X.
           02  INFOMSGV    PICTURE X.
           02  INFOMSGO  PIC X(45).
           02  FILLER PICTURE X(3).
           02  ERRMSGC    PICTURE X.
           02  ERRMSGP    PICTURE X.
           02  ERRMSGH    PICTURE X.
           02  ERRMSGV    PICTURE X.
           02  ERRMSGO  PIC X(78).
