           02  FILLER   PICTURE X(4).
           02  ACURBALI  PIC X(15).
           02  ACRCYCRL    COMP  PIC  S9(4).
           02  ACRCYCRF    PICTURE X.
           02  FILLER REDEFINES ACRCYCRF.
             03 ACRCYCRA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACRCYCRI  PIC X(15).
           02  AADDGRPL    COMP  PIC  S9(4).
           02  AADDGRPF    PICTURE X.
           02  FILLER REDEFINES AADDGRPF.
             03 AADDGRPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  AADDGRPI  PIC X(10).
           02  ACRCYDBL    COMP  PIC  S9(4).
           02  ACRCYDBF    PICTURE X.
           02  FILLER REDEFINES ACRCYDBF.
             03 ACRCYDBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACRCYDBI  PIC X(15).
           02  ACSTNUML    COMP  PIC  S9(4).
           02  ACSTNUMF    PICTURE X.
           02  FILLER REDEFINES ACSTNUMF.
             03 ACSTNUMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSTNUMI  PIC X(9).
           02  ACSTSSNL    COMP  PIC  S9(4).
           02  ACSTSSNF    PICTURE X.
           02  FILLER REDEFINES ACSTSSNF.
             03 ACSTSSNA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSTSSNI  PIC X(12).
           02  ACSTDOBL    COMP  PIC  S9(4).
           02  ACSTDOBF    PICTURE X.
           02  FILLER REDEFINES ACSTDOBF.
             03 ACSTDOBA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSTDOBI  PIC X(10).
           02  ACSTFCOL    COMP  PIC  S9(4).
           02  ACSTFCOF    PICTURE X.
           02  FILLER REDEFINES ACSTFCOF.
             03 ACSTFCOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSTFCOI  PIC X(3).
           02  ACSFNAML    COMP  PIC  S9(4).
           02  ACSFNAMF    PICTURE X.
           02  FILLER REDEFINES ACSFNAMF.
             03 ACSFNAMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSFNAMI  PIC X(25).
           02  ACSMNAML    COMP  PIC  S9(4).
           02  ACSMNAMF    PICTURE X.
           02  FILLER REDEFINES ACSMNAMF.
             03 ACSMNAMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSMNAMI  PIC X(25).
           02  ACSLNAML    COMP  PIC  S9(4).
           02  ACSLNAMF    PICTURE X.
           02  FILLER REDEFINES ACSLNAMF.
             03 ACSLNAMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSLNAMI  PIC X(25).
           02  ACSADL1L    COMP  PIC  S9(4).
           02  ACSADL1F    PICTURE X.
           02  FILLER REDEFINES ACSADL1F.
             03 ACSADL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSADL1I  PIC X(50).
           02  ACSSTTEL    COMP  PIC  S9(4).
           02  ACSSTTEF    PICTURE X.
           02  FILLER REDEFINES ACSSTTEF.
             03 ACSSTTEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSSTTEI  PIC X(2).
           02  ACSADL2L    COMP  PIC  S9(4).
           02  ACSADL2F    PICTURE X.
           02  FILLER REDEFINES ACSADL2F.
             03 ACSADL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSADL2I  PIC X(50).
           02  ACSZIPCL    COMP  PIC  S9(4).
           02  ACSZIPCF    PICTURE X.
           02  FILLER REDEFINES ACSZIPCF.
             03 ACSZIPCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSZIPCI  PIC X(5).
           02  ACSCITYL    COMP  PIC  S9(4).
           02  ACSCITYF    PICTURE X.
           02  FILLER REDEFINES ACSCITYF.
             03 ACSCITYA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSCITYI  PIC X(50).
           02  ACSCTRYL    COMP  PIC  S9(4).
           02  ACSCTRYF    PICTURE X.
           02  FILLER REDEFINES ACSCTRYF.
             03 ACSCTRYA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSCTRYI  PIC X(3).
           02  ACSPHN1L    COMP  PIC  S9(4).
           02  ACSPHN1F    PICTURE X.
