           02  ACRDLIMV    PICTURE X.
           02  ACRDLIMO PIC +ZZZ,ZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  AEXPDTC    PICTURE X.
           02  AEXPDTP    PICTURE X.
           02  AEXPDTH    PICTURE X.
           02  AEXPDTV    PICTURE X.
           02  AEXPDTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ACSHLIMC    PICTURE X.
           02  ACSHLIMP    PICTURE X.
           02  ACSHLIMH    PICTURE X.
           02  ACSHLIMV    PICTURE X.
           02  ACSHLIMO PIC +ZZZ,ZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  AREISDTC    PICTURE X.
           02  AREISDTP    PICTURE X.
           02  AREISDTH    PICTURE X.
           02  AREISDTV    PICTURE X.
           02  AREISDTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ACURBALC    PICTURE X.
           02  ACURBALP    PICTURE X.
           02  ACURBALH    PICTURE X.
           02  ACURBALV    PICTURE X.
           02  ACURBALO PIC +ZZZ,ZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  ACRCYCRC    PICTURE X.
           02  ACRCYCRP    PICTURE X.
           02  ACRCYCRH    PICTURE X.
           02  ACRCYCRV    PICTURE X.
           02  ACRCYCRO PIC +ZZZ,ZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  AADDGRPC    PICTURE X.
           02  AADDGRPP    PICTURE X.
           02  AADDGRPH    PICTURE X.
           02  AADDGRPV    PICTURE X.
           02  AADDGRPO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ACRCYDBC    PICTURE X.
           02  ACRCYDBP    PICTURE X.
           02  ACRCYDBH    PICTURE X.
           02  ACRCYDBV    PICTURE X.
           02  ACRCYDBO PIC +ZZZ,ZZZ,ZZZ.99.
           02  FILLER PICTURE X(3).
           02  ACSTNUMC    PICTURE X.
           02  ACSTNUMP    PICTURE X.
           02  ACSTNUMH    PICTURE X.
           02  ACSTNUMV    PICTURE X.
           02  ACSTNUMO  PIC X(9).
           02  FILLER PICTURE X(3).
           02  ACSTSSNC    PICTURE X.
           02  ACSTSSNP    PICTURE X.
           02  ACSTSSNH    PICTURE X.
           02  ACSTSSNV    PICTURE X.
           02  ACSTSSNO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  ACSTDOBC    PICTURE X.
           02  ACSTDOBP    PICTURE X.
           02  ACSTDOBH    PICTURE X.
           02  ACSTDOBV    PICTURE X.
           02  ACSTDOBO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ACSTFCOC    PICTURE X.
           02  ACSTFCOP    PICTURE X.
           02  ACSTFCOH    PICTURE X.
           02  ACSTFCOV    PICTURE X.
           02  ACSTFCOO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  ACSFNAMC    PICTURE X.
           02  ACSFNAMP    PICTURE X.
           02  ACSFNAMH    PICTURE X.
           02  ACSFNAMV    PICTURE X.
           02  ACSFNAMO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  ACSMNAMC    PICTURE X.
           02  ACSMNAMP    PICTURE X.
           02  ACSMNAMH    PICTURE X.
           02  ACSMNAMV    PICTURE X.
           02  ACSMNAMO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  ACSLNAMC    PICTURE X.
           02  ACSLNAMP    PICTURE X.
           02  ACSLNAMH    PICTURE X.
           02  ACSLNAMV    PICTURE X.
           02  ACSLNAMO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  ACSADL1C    PICTURE X.
           02  ACSADL1P    PICTURE X.
           02  ACSADL1H    PICTURE X.
           02  ACSADL1V    PICTURE X.
           02  ACSADL1O  PIC X(50).
           02  FILLER PICTURE X(3).
           02  ACSSTTEC    PICTURE X.
           02  ACSSTTEP    PICTURE X.
           02  ACSSTTEH    PICTURE X.
           02  ACSSTTEV    PICTURE X.
           02  ACSSTTEO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  ACSADL2C    PICTURE X.
