           02  FILLER PICTURE X(3).
           02  ACTSSN3C    PICTURE X.
           02  ACTSSN3P    PICTURE X.
           02  ACTSSN3H    PICTURE X.
           02  ACTSSN3V    PICTURE X.
           02  ACTSSN3O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DOBYEARC    PICTURE X.
           02  DOBYEARP    PICTURE X.
           02  DOBYEARH    PICTURE X.
           02  DOBYEARV    PICTURE X.
           02  DOBYEARO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  DOBMONC    PICTURE X.
           02  DOBMONP    PICTURE X.
           02  DOBMONH    PICTURE X.
           02  DOBMONV    PICTURE X.
           02  DOBMONO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DOBDAYC    PICTURE X.
           02  DOBDAYP    PICTURE X.
           02  DOBDAYH    PICTURE X.
           02  DOBDAYV    PICTURE X.
           02  DOBDAYO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  ACSTFCOC    PICTURE X.
           02  ACSTFCOP    PICTURE X.
           02  ACSTFCOH    PICTURE X.
           02  ACSTFCOV    PICTURE X.
           02  ACSTFCOO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  ACSFNAMC    PICTURE X.
           02  ACSFNAMP    PICTURE X.
           02  ACSFNAMH    PICTURE X.
           02  ACSFNAMV    PICTURE X.
           02  ACSFNAMO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  ACSMNAMC    PICTURE X.
           02  ACSMNAMP    PICTURE X.
           02  ACSMNAMH    PICTURE X.
           02  ACSMNAMV    PICTURE X.
           02  ACSMNAMO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  ACSLNAMC    PICTURE X.
           02  ACSLNAMP    PICTURE X.
           02  ACSLNAMH    PICTURE X.
           02  ACSLNAMV    PICTURE X.
           02  ACSLNAMO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  ACSADL1C    PICTURE X.
           02  ACSADL1P    PICTURE X.
           02  ACSADL1H    PICTURE X.
           02  ACSADL1V    PICTURE X.
           02  ACSADL1O  PIC X(50).
           02  FILLER PICTURE X(3).
           02  ACSSTTEC    PICTURE X.
           02  ACSSTTEP    PICTURE X.
           02  ACSSTTEH    PICTURE X.
           02  ACSSTTEV    PICTURE X.
           02  ACSSTTEO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  ACSADL2C    PICTURE X.
           02  ACSADL2P    PICTURE X.
           02  ACSADL2H    PICTURE X.
           02  ACSADL2V    PICTURE X.
           02  ACSADL2O  PIC X(50).
           02  FILLER PICTURE X(3).
           02  ACSZIPCC    PICTURE X.
           02  ACSZIPCP    PICTURE X.
           02  ACSZIPCH    PICTURE X.
           02  ACSZIPCV    PICTURE X.
           02  ACSZIPCO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  ACSCITYC    PICTURE X.
           02  ACSCITYP    PICTURE X.
           02  ACSCITYH    PICTURE X.
           02  ACSCITYV    PICTURE X.
           02  ACSCITYO  PIC X(50).
           02  FILLER PICTURE X(3).
           02  ACSCTRYC    PICTURE X.
           02  ACSCTRYP    PICTURE X.
           02  ACSCTRYH    PICTURE X.
           02  ACSCTRYV    PICTURE X.
           02  ACSCTRYO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  ACSPH1AC    PICTURE X.
           02  ACSPH1AP    PICTURE X.
           02  ACSPH1AH    PICTURE X.
           02  ACSPH1AV    PICTURE X.
           02  ACSPH1AO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  ACSPH1BC    PICTURE X.
           02  ACSPH1BP    PICTURE X.
           02  ACSPH1BH    PICTURE X.
           02  ACSPH1BV    PICTURE X.
           02  ACSPH1BO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  ACSPH1CC    PICTURE X.
           02  ACSPH1CP    PICTURE X.
           02  ACSPH1CH    PICTURE X.
