           02  ACSEFTCL    COMP  PIC  S9(4).
           02  ACSEFTCF    PICTURE X.
           02  FILLER REDEFINES ACSEFTCF.
             03 ACSEFTCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSEFTCI  PIC X(10).
           02  ACSPFLGL    COMP  PIC  S9(4).
           02  ACSPFLGF    PICTURE X.
           02  FILLER REDEFINES ACSPFLGF.
             03 ACSPFLGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSPFLGI  PIC X(1).
           02  INFOMSGL    COMP  PIC  S9(4).
           02  INFOMSGF    PICTURE X.
           02  FILLER REDEFINES INFOMSGF.
             03 INFOMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  INFOMSGI  PIC X(45).
           02  ERRMSGL    COMP  PIC  S9(4).
           02  ERRMSGF    PICTURE X.
           02  FILLER REDEFINES ERRMSGF.
             03 ERRMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ERRMSGI  PIC X(78).
           02  FKEYSL    COMP  PIC  S9(4).
           02  FKEYSF    PICTURE X.
           02  FILLER REDEFINES FKEYSF.
             03 FKEYSA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FKEYSI  PIC X(21).
           02  FKEY05L    COMP  PIC  S9(4).
           02  FKEY05F    PICTURE X.
           02  FILLER REDEFINES FKEY05F.
             03 FKEY05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FKEY05I  PIC X(7).
           02  FKEY12L    COMP  PIC  S9(4).
           02  FKEY12F    PICTURE X.
           02  FILLER REDEFINES FKEY12F.
             03 FKEY12A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FKEY12I  PIC X(10).
       01  CACTUPAO REDEFINES CACTUPAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  TRNNAMEC    PICTURE X.
           02  TRNNAMEP    PICTURE X.
           02  TRNNAMEH    PICTURE X.
           02  TRNNAMEV    PICTURE X.
           02  TRNNAMEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  TITLE01C    PICTURE X.
           02  TITLE01P    PICTURE X.
           02  TITLE01H    PICTURE X.
           02  TITLE01V    PICTURE X.
           02  TITLE01O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURDATEC    PICTURE X.
           02  CURDATEP    PICTURE X.
           02  CURDATEH    PICTURE X.
           02  CURDATEV    PICTURE X.
           02  CURDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PGMNAMEC    PICTURE X.
           02  PGMNAMEP    PICTURE X.
           02  PGMNAMEH    PICTURE X.
           02  PGMNAMEV    PICTURE X.
           02  PGMNAMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TITLE02C    PICTURE X.
           02  TITLE02P    PICTURE X.
           02  TITLE02H    PICTURE X.
           02  TITLE02V    PICTURE X.
           02  TITLE02O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURTIMEC    PICTURE X.
           02  CURTIMEP    PICTURE X.
           02  CURTIMEH    PICTURE X.
           02  CURTIMEV    PICTURE X.
           02  CURTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ACCTSIDC    PICTURE X.
           02  ACCTSIDP    PICTURE X.
           02  ACCTSIDH    PICTURE X.
           02  ACCTSIDV    PICTURE X.
           02  ACCTSIDO  PIC X(11).
           02  FILLER PICTURE X(3).
           02  ACSTTUSC    PICTURE X.
           02  ACSTTUSP    PICTURE X.
           02  ACSTTUSH    PICTURE X.
           02  ACSTTUSV    PICTURE X.
           02  ACSTTUSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  OPNYEARC    PICTURE X.
           02  OPNYEARP    PICTURE X.
           02  OPNYEARH    PICTURE X.
           02  OPNYEARV    PICTURE X.
           02  OPNYEARO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  OPNMONC    PICTURE X.
