           02  FILLER REDEFINES ACSPHN1F.
             03 ACSPHN1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSPHN1I  PIC X(13).
           02  ACSGOVTL    COMP  PIC  S9(4).
           02  ACSGOVTF    PICTURE X.
           02  FILLER REDEFINES ACSGOVTF.
             03 ACSGOVTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSGOVTI  PIC X(20).
           02  ACSPHN2L    COMP  PIC  S9(4).
           02  ACSPHN2F    PICTURE X.
           02  FILLER REDEFINES ACSPHN2F.
             03 ACSPHN2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSPHN2I  PIC X(13).
           02  ACSEFTCL    COMP  PIC  S9(4).
           02  ACSEFTCF    PICTURE X.
           02  FILLER REDEFINES ACSEFTCF.
             03 ACSEFTCA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSEFTCI  PIC X(10).
           02  ACSPFLGL    COMP  PIC  S9(4).
           02  ACSPFLGF    PICTURE X.
           02  FILLER REDEFINES ACSPFLGF.
             03 ACSPFLGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACSPFLGI  PIC X(1).
           02  INFOMSGL    COMP  PIC  S9(4).
           02  INFOMSGF    PICTURE X.
           02  FILLER REDEFINES INFOMSGF.
             03 INFOMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  INFOMSGI  PIC X(45).
           02  ERRMSGL    COMP  PIC  S9(4).
           02  ERRMSGF    PICTURE X.
           02  FILLER REDEFINES ERRMSGF.
             03 ERRMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ERRMSGI  PIC X(78).
       01  CACTVWAO REDEFINES CACTVWAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  TRNNAMEC    PICTURE X.
           02  TRNNAMEP    PICTURE X.
           02  TRNNAMEH    PICTURE X.
           02  TRNNAMEV    PICTURE X.
           02  TRNNAMEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  TITLE01C    PICTURE X.
           02  TITLE01P    PICTURE X.
           02  TITLE01H    PICTURE X.
           02  TITLE01V    PICTURE X.
           02  TITLE01O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURDATEC    PICTURE X.
           02  CURDATEP    PICTURE X.
           02  CURDATEH    PICTURE X.
           02  CURDATEV    PICTURE X.
           02  CURDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PGMNAMEC    PICTURE X.
           02  PGMNAMEP    PICTURE X.
           02  PGMNAMEH    PICTURE X.
           02  PGMNAMEV    PICTURE X.
           02  PGMNAMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TITLE02C    PICTURE X.
           02  TITLE02P    PICTURE X.
           02  TITLE02H    PICTURE X.
           02  TITLE02V    PICTURE X.
           02  TITLE02O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURTIMEC    PICTURE X.
           02  CURTIMEP    PICTURE X.
           02  CURTIMEH    PICTURE X.
           02  CURTIMEV    PICTURE X.
           02  CURTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ACCTSIDC    PICTURE X.
           02  ACCTSIDP    PICTURE X.
           02  ACCTSIDH    PICTURE X.
           02  ACCTSIDV    PICTURE X.
           02  ACCTSIDO  PIC X(11).
           02  FILLER PICTURE X(3).
           02  ACSTTUSC    PICTURE X.
           02  ACSTTUSP    PICTURE X.
           02  ACSTTUSH    PICTURE X.
           02  ACSTTUSV    PICTURE X.
           02  ACSTTUSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ADTOPENC    PICTURE X.
           02  ADTOPENP    PICTURE X.
           02  ADTOPENH    PICTURE X.
           02  ADTOPENV    PICTURE X.
           02  ADTOPENO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ACRDLIMC    PICTURE X.
           02  ACRDLIMP    PICTURE X.
           02  ACRDLIMH    PICTURE X.
