           02  FILLER   PICTURE X(4).
           02  OPTN008I  PIC X(40).
           02  OPTN009L    COMP  PIC  S9(4).
           02  OPTN009F    PICTURE X.
           02  FILLER REDEFINES OPTN009F.
             03 OPTN009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  OPTN009I  PIC X(40).
           02  OPTN010L    COMP  PIC  S9(4).
           02  OPTN010F    PICTURE X.
           02  FILLER REDEFINES OPTN010F.
             03 OPTN010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  OPTN010I  PIC X(40).
           02  OPTN011L    COMP  PIC  S9(4).
           02  OPTN011F    PICTURE X.
           02  FILLER REDEFINES OPTN011F.
             03 OPTN011A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  OPTN011I  PIC X(40).
           02  OPTN012L    COMP  PIC  S9(4).
           02  OPTN012F    PICTURE X.
           02  FILLER REDEFINES OPTN012F.
             03 OPTN012A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  OPTN012I  PIC X(40).
           02  OPTIONL    COMP  PIC  S9(4).
           02  OPTIONF    PICTURE X.
           02  FILLER REDEFINES OPTIONF.
             03 OPTIONA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  OPTIONI  PIC X(2).
           02  ERRMSGL    COMP  PIC  S9(4).
           02  ERRMSGF    PICTURE X.
           02  FILLER REDEFINES ERRMSGF.
             03 ERRMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ERRMSGI  PIC X(78).
       01  COADM1AO REDEFINES COADM1AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  TRNNAMEC    PICTURE X.
           02  TRNNAMEP    PICTURE X.
           02  TRNNAMEH    PICTURE X.
           02  TRNNAMEV    PICTURE X.
           02  TRNNAMEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  TITLE01C    PICTURE X.
           02  TITLE01P    PICTURE X.
           02  TITLE01H    PICTURE X.
           02  TITLE01V    PICTURE X.
           02  TITLE01O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURDATEC    PICTURE X.
           02  CURDATEP    PICTURE X.
           02  CURDATEH    PICTURE X.
           02  CURDATEV    PICTURE X.
           02  CURDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PGMNAMEC    PICTURE X.
           02  PGMNAMEP    PICTURE X.
           02  PGMNAMEH    PICTURE X.
           02  PGMNAMEV    PICTURE X.
           02  PGMNAMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TITLE02C    PICTURE X.
           02  TITLE02P    PICTURE X.
           02  TITLE02H    PICTURE X.
           02  TITLE02V    PICTURE X.
           02  TITLE02O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURTIMEC    PICTURE X.
           02  CURTIMEP    PICTURE X.
           02  CURTIMEH    PICTURE X.
           02  CURTIMEV    PICTURE X.
           02  CURTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  OPTN001C    PICTURE X.
           02  OPTN001P    PICTURE X.
           02  OPTN001H    PICTURE X.
           02  OPTN001V    PICTURE X.
           02  OPTN001O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  OPTN002C    PICTURE X.
           02  OPTN002P    PICTURE X.
           02  OPTN002H    PICTURE X.
           02  OPTN002V    PICTURE X.
           02  OPTN002O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  OPTN003C    PICTURE X.
           02  OPTN003P    PICTURE X.
           02  OPTN003H    PICTURE X.
           02  OPTN003V    PICTURE X.
           02  OPTN003O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  OPTN004C    PICTURE X.
           02  OPTN004P    PICTURE X.
           02  OPTN004H    PICTURE X.
           02  OPTN004V    PICTURE X.
           02  OPTN004O  PIC X(40).
