           02  FILLER   PICTURE X(4).
           02  ERRMSGI  PIC X(80).
           02  FKEYSL    COMP  PIC  S9(4).
           02  FKEYSF    PICTURE X.
           02  FILLER REDEFINES FKEYSF.
             03 FKEYSA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FKEYSI  PIC X(75).
       01  CCRDSLAO REDEFINES CCRDSLAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  TRNNAMEC    PICTURE X.
           02  TRNNAMEP    PICTURE X.
           02  TRNNAMEH    PICTURE X.
           02  TRNNAMEV    PICTURE X.
           02  TRNNAMEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  TITLE01C    PICTURE X.
           02  TITLE01P    PICTURE X.
           02  TITLE01H    PICTURE X.
           02  TITLE01V    PICTURE X.
           02  TITLE01O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURDATEC    PICTURE X.
           02  CURDATEP    PICTURE X.
           02  CURDATEH    PICTURE X.
           02  CURDATEV    PICTURE X.
           02  CURDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PGMNAMEC    PICTURE X.
           02  PGMNAMEP    PICTURE X.
           02  PGMNAMEH    PICTURE X.
           02  PGMNAMEV    PICTURE X.
           02  PGMNAMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TITLE02C    PICTURE X.
           02  TITLE02P    PICTURE X.
           02  TITLE02H    PICTURE X.
           02  TITLE02V    PICTURE X.
           02  TITLE02O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURTIMEC    PICTURE X.
           02  CURTIMEP    PICTURE X.
           02  CURTIMEH    PICTURE X.
           02  CURTIMEV    PICTURE X.
           02  CURTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ACCTSIDC    PICTURE X.
           02  ACCTSIDP    PICTURE X.
           02  ACCTSIDH    PICTURE X.
           02  ACCTSIDV    PICTURE X.
           02  ACCTSIDO  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CARDSIDC    PICTURE X.
           02  CARDSIDP    PICTURE X.
           02  CARDSIDH    PICTURE X.
           02  CARDSIDV    PICTURE X.
           02  CARDSIDO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDNAMEC    PICTURE X.
           02  CRDNAMEP    PICTURE X.
           02  CRDNAMEH    PICTURE X.
           02  CRDNAMEV    PICTURE X.
           02  CRDNAMEO  PIC X(50).
           02  FILLER PICTURE X(3).
           02  CRDSTCDC    PICTURE X.
           02  CRDSTCDP    PICTURE X.
           02  CRDSTCDH    PICTURE X.
           02  CRDSTCDV    PICTURE X.
           02  CRDSTCDO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  EXPMONC    PICTURE X.
           02  EXPMONP    PICTURE X.
           02  EXPMONH    PICTURE X.
           02  EXPMONV    PICTURE X.
           02  EXPMONO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  EXPYEARC    PICTURE X.
           02  EXPYEARP    PICTURE X.
           02  EXPYEARH    PICTURE X.
           02  EXPYEARV    PICTURE X.
           02  EXPYEARO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  INFOMSGC    PICTURE X.
           02  INFOMSGP    PICTURE X.
           02  INFOMSGH    PICTURE X.
           02  INFOMSGV    PICTURE X.
           02  INFOMSGO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  ERRMSGC    PICTURE X.
           02  ERRMSGP    PICTURE X.
           02  ERRMSGH    PICTURE X.
           02  ERRMSGV    PICTURE X.
           02  ERRMSGO  PIC X(80).
           02  FILLER PICTURE X(3).
           02  FKEYSC    PICTURE X.
           02  FKEYSP    PICTURE X.
           02  FKEYSH    PICTURE X.
           02  FKEYSV    PICTURE X.
           02  FKEYSO  PIC X(75).
