           02  CRDSEL3P    PICTURE X.
           02  CRDSEL3H    PICTURE X.
           02  CRDSEL3V    PICTURE X.
           02  CRDSEL3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSTP3C    PICTURE X.
           02  CRDSTP3P    PICTURE X.
           02  CRDSTP3H    PICTURE X.
           02  CRDSTP3V    PICTURE X.
           02  CRDSTP3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ACCTNO3C    PICTURE X.
           02  ACCTNO3P    PICTURE X.
           02  ACCTNO3H    PICTURE X.
           02  ACCTNO3V    PICTURE X.
           02  ACCTNO3O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CRDNUM3C    PICTURE X.
           02  CRDNUM3P    PICTURE X.
           02  CRDNUM3H    PICTURE X.
           02  CRDNUM3V    PICTURE X.
           02  CRDNUM3O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSTS3C    PICTURE X.
           02  CRDSTS3P    PICTURE X.
           02  CRDSTS3H    PICTURE X.
           02  CRDSTS3V    PICTURE X.
           02  CRDSTS3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSEL4C    PICTURE X.
           02  CRDSEL4P    PICTURE X.
           02  CRDSEL4H    PICTURE X.
           02  CRDSEL4V    PICTURE X.
           02  CRDSEL4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSTP4C    PICTURE X.
           02  CRDSTP4P    PICTURE X.
           02  CRDSTP4H    PICTURE X.
           02  CRDSTP4V    PICTURE X.
           02  CRDSTP4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ACCTNO4C    PICTURE X.
           02  ACCTNO4P    PICTURE X.
           02  ACCTNO4H    PICTURE X.
           02  ACCTNO4V    PICTURE X.
           02  ACCTNO4O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CRDNUM4C    PICTURE X.
           02  CRDNUM4P    PICTURE X.
           02  CRDNUM4H    PICTURE X.
           02  CRDNUM4V    PICTURE X.
           02  CRDNUM4O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSTS4C    PICTURE X.
           02  CRDSTS4P    PICTURE X.
           02  CRDSTS4H    PICTURE X.
           02  CRDSTS4V    PICTURE X.
           02  CRDSTS4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSEL5C    PICTURE X.
           02  CRDSEL5P    PICTURE X.
           02  CRDSEL5H    PICTURE X.
           02  CRDSEL5V    PICTURE X.
           02  CRDSEL5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSTP5C    PICTURE X.
           02  CRDSTP5P    PICTURE X.
           02  CRDSTP5H    PICTURE X.
           02  CRDSTP5V    PICTURE X.
           02  CRDSTP5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ACCTNO5C    PICTURE X.
           02  ACCTNO5P    PICTURE X.
           02  ACCTNO5H    PICTURE X.
           02  ACCTNO5V    PICTURE X.
           02  ACCTNO5O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CRDNUM5C    PICTURE X.
           02  CRDNUM5P    PICTURE X.
           02  CRDNUM5H    PICTURE X.
           02  CRDNUM5V    PICTURE X.
           02  CRDNUM5O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSTS5C    PICTURE X.
           02  CRDSTS5P    PICTURE X.
           02  CRDSTS5H    PICTURE X.
           02  CRDSTS5V    PICTURE X.
           02  CRDSTS5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSEL6C    PICTURE X.
           02  CRDSEL6P    PICTURE X.
           02  CRDSEL6H    PICTURE X.
           02  CRDSEL6V    PICTURE X.
           02  CRDSEL6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSTP6C    PICTURE X.
           02  CRDSTP6P    PICTURE X.
           02  CRDSTP6H    PICTURE X.
           02  CRDSTP6V    PICTURE X.
           02  CRDSTP6O  PIC X(1).
