           02  FILLER PICTURE X(3).
           02  ACCTNO6C    PICTURE X.
           02  ACCTNO6P    PICTURE X.
           02  ACCTNO6H    PICTURE X.
           02  ACCTNO6V    PICTURE X.
           02  ACCTNO6O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CRDNUM6C    PICTURE X.
           02  CRDNUM6P    PICTURE X.
           02  CRDNUM6H    PICTURE X.
           02  CRDNUM6V    PICTURE X.
           02  CRDNUM6O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSTS6C    PICTURE X.
           02  CRDSTS6P    PICTURE X.
           02  CRDSTS6H    PICTURE X.
           02  CRDSTS6V    PICTURE X.
           02  CRDSTS6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSEL7C    PICTURE X.
           02  CRDSEL7P    PICTURE X.
           02  CRDSEL7H    PICTURE X.
           02  CRDSEL7V    PICTURE X.
           02  CRDSEL7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSTP7C    PICTURE X.
           02  CRDSTP7P    PICTURE X.
           02  CRDSTP7H    PICTURE X.
           02  CRDSTP7V    PICTURE X.
           02  CRDSTP7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ACCTNO7C    PICTURE X.
           02  ACCTNO7P    PICTURE X.
           02  ACCTNO7H    PICTURE X.
           02  ACCTNO7V    PICTURE X.
           02  ACCTNO7O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CRDNUM7C    PICTURE X.
           02  CRDNUM7P    PICTURE X.
           02  CRDNUM7H    PICTURE X.
           02  CRDNUM7V    PICTURE X.
           02  CRDNUM7O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSTS7C    PICTURE X.
           02  CRDSTS7P    PICTURE X.
           02  CRDSTS7H    PICTURE X.
           02  CRDSTS7V    PICTURE X.
           02  CRDSTS7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  INFOMSGC    PICTURE X.
           02  INFOMSGP    PICTURE X.
           02  INFOMSGH    PICTURE X.
           02  INFOMSGV    PICTURE X.
           02  INFOMSGO  PIC X(45).
           02  FILLER PICTURE X(3).
           02  ERRMSGC    PICTURE X.
           02  ERRMSGP    PICTURE X.
           02  ERRMSGH    PICTURE X.
           02  ERRMSGV    PICTURE X.
           02  ERRMSGO  PIC X(78).
