           02  FILLER   PICTURE X(4).
           02  CRDSEL2I  PIC X(1).
           02  CRDSTP2L    COMP  PIC  S9(4).
           02  CRDSTP2F    PICTURE X.
           02  FILLER REDEFINES CRDSTP2F.
             03 CRDSTP2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTP2I  PIC X(1).
           02  ACCTNO2L    COMP  PIC  S9(4).
           02  ACCTNO2F    PICTURE X.
           02  FILLER REDEFINES ACCTNO2F.
             03 ACCTNO2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTNO2I  PIC X(11).
           02  CRDNUM2L    COMP  PIC  S9(4).
           02  CRDNUM2F    PICTURE X.
           02  FILLER REDEFINES CRDNUM2F.
             03 CRDNUM2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDNUM2I  PIC X(16).
           02  CRDSTS2L    COMP  PIC  S9(4).
           02  CRDSTS2F    PICTURE X.
           02  FILLER REDEFINES CRDSTS2F.
             03 CRDSTS2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTS2I  PIC X(1).
           02  CRDSEL3L    COMP  PIC  S9(4).
           02  CRDSEL3F    PICTURE X.
           02  FILLER REDEFINES CRDSEL3F.
             03 CRDSEL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSEL3I  PIC X(1).
           02  CRDSTP3L    COMP  PIC  S9(4).
           02  CRDSTP3F    PICTURE X.
           02  FILLER REDEFINES CRDSTP3F.
             03 CRDSTP3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTP3I  PIC X(1).
           02  ACCTNO3L    COMP  PIC  S9(4).
           02  ACCTNO3F    PICTURE X.
           02  FILLER REDEFINES ACCTNO3F.
             03 ACCTNO3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTNO3I  PIC X(11).
           02  CRDNUM3L    COMP  PIC  S9(4).
           02  CRDNUM3F    PICTURE X.
           02  FILLER REDEFINES CRDNUM3F.
             03 CRDNUM3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDNUM3I  PIC X(16).
           02  CRDSTS3L    COMP  PIC  S9(4).
           02  CRDSTS3F    PICTURE X.
           02  FILLER REDEFINES CRDSTS3F.
             03 CRDSTS3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTS3I  PIC X(1).
           02  CRDSEL4L    COMP  PIC  S9(4).
           02  CRDSEL4F    PICTURE X.
           02  FILLER REDEFINES CRDSEL4F.
             03 CRDSEL4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSEL4I  PIC X(1).
           02  CRDSTP4L    COMP  PIC  S9(4).
           02  CRDSTP4F    PICTURE X.
           02  FILLER REDEFINES CRDSTP4F.
             03 CRDSTP4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTP4I  PIC X(1).
           02  ACCTNO4L    COMP  PIC  S9(4).
           02  ACCTNO4F    PICTURE X.
           02  FILLER REDEFINES ACCTNO4F.
             03 ACCTNO4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTNO4I  PIC X(11).
           02  CRDNUM4L    COMP  PIC  S9(4).
           02  CRDNUM4F    PICTURE X.
           02  FILLER REDEFINES CRDNUM4F.
             03 CRDNUM4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDNUM4I  PIC X(16).
           02  CRDSTS4L    COMP  PIC  S9(4).
           02  CRDSTS4F    PICTURE X.
           02  FILLER REDEFINES CRDSTS4F.
             03 CRDSTS4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTS4I  PIC X(1).
           02  CRDSEL5L    COMP  PIC  S9(4).
           02  CRDSEL5F    PICTURE X.
           02  FILLER REDEFINES CRDSEL5F.
             03 CRDSEL5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSEL5I  PIC X(1).
           02  CRDSTP5L    COMP  PIC  S9(4).
           02  CRDSTP5F    PICTURE X.
           02  FILLER REDEFINES CRDSTP5F.
             03 CRDSTP5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTP5I  PIC X(1).
           02  ACCTNO5L    COMP  PIC  S9(4).
           02  ACCTNO5F    PICTURE X.
