      ******************************************************************
      * Copyright Amazon.com, Inc. or its affiliates.                   
      * All Rights Reserved.                                            
      *                                                                 
      * Licensed under the Apache License, Version 2.0 (the "License"). 
      * You may not use this file except in compliance with the License.
      * You may obtain a copy of the License at                         
      *                                                                 
      *    http://www.apache.org/licenses/LICENSE-2.0                   
      *                                                                 
      * Unless required by applicable law or agreed to in writing,      
      * software distributed under the License is distributed on an     
      * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,    
      * either express or implied. See the License for the specific     
      * language governing permissions and limitations under the License
      ****************************************************************** 
       01  CCRDLIAI.
           02  FILLER PIC X(12).
           02  TRNNAMEL    COMP  PIC  S9(4).
           02  TRNNAMEF    PICTURE X.
           02  FILLER REDEFINES TRNNAMEF.
             03 TRNNAMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRNNAMEI  PIC X(4).
           02  TITLE01L    COMP  PIC  S9(4).
           02  TITLE01F    PICTURE X.
           02  FILLER REDEFINES TITLE01F.
             03 TITLE01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TITLE01I  PIC X(40).
           02  CURDATEL    COMP  PIC  S9(4).
           02  CURDATEF    PICTURE X.
           02  FILLER REDEFINES CURDATEF.
             03 CURDATEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CURDATEI  PIC X(8).
           02  PGMNAMEL    COMP  PIC  S9(4).
           02  PGMNAMEF    PICTURE X.
           02  FILLER REDEFINES PGMNAMEF.
             03 PGMNAMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PGMNAMEI  PIC X(8).
           02  TITLE02L    COMP  PIC  S9(4).
           02  TITLE02F    PICTURE X.
           02  FILLER REDEFINES TITLE02F.
             03 TITLE02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TITLE02I  PIC X(40).
           02  CURTIMEL    COMP  PIC  S9(4).
           02  CURTIMEF    PICTURE X.
           02  FILLER REDEFINES CURTIMEF.
             03 CURTIMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CURTIMEI  PIC X(8).
           02  PAGENOL    COMP  PIC  S9(4).
           02  PAGENOF    PICTURE X.
           02  FILLER REDEFINES PAGENOF.
             03 PAGENOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PAGENOI  PIC X(3).
           02  ACCTSIDL    COMP  PIC  S9(4).
           02  ACCTSIDF    PICTURE X.
           02  FILLER REDEFINES ACCTSIDF.
             03 ACCTSIDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTSIDI  PIC X(11).
           02  CARDSIDL    COMP  PIC  S9(4).
           02  CARDSIDF    PICTURE X.
           02  FILLER REDEFINES CARDSIDF.
             03 CARDSIDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CARDSIDI  PIC X(16).
           02  CRDSEL1L    COMP  PIC  S9(4).
           02  CRDSEL1F    PICTURE X.
           02  FILLER REDEFINES CRDSEL1F.
             03 CRDSEL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSEL1I  PIC X(1).
           02  ACCTNO1L    COMP  PIC  S9(4).
           02  ACCTNO1F    PICTURE X.
           02  FILLER REDEFINES ACCTNO1F.
             03 ACCTNO1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTNO1I  PIC X(11).
           02  CRDNUM1L    COMP  PIC  S9(4).
           02  CRDNUM1F    PICTURE X.
           02  FILLER REDEFINES CRDNUM1F.
             03 CRDNUM1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDNUM1I  PIC X(16).
           02  CRDSTS1L    COMP  PIC  S9(4).
           02  CRDSTS1F    PICTURE X.
           02  FILLER REDEFINES CRDSTS1F.
             03 CRDSTS1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTS1I  PIC X(1).
           02  CRDSEL2L    COMP  PIC  S9(4).
           02  CRDSEL2F    PICTURE X.
           02  FILLER REDEFINES CRDSEL2F.
             03 CRDSEL2A    PICTURE X.
