           02  TITLE01V    PICTURE X.
           02  TITLE01O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURDATEC    PICTURE X.
           02  CURDATEP    PICTURE X.
           02  CURDATEH    PICTURE X.
           02  CURDATEV    PICTURE X.
           02  CURDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PGMNAMEC    PICTURE X.
           02  PGMNAMEP    PICTURE X.
           02  PGMNAMEH    PICTURE X.
           02  PGMNAMEV    PICTURE X.
           02  PGMNAMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TITLE02C    PICTURE X.
           02  TITLE02P    PICTURE X.
           02  TITLE02H    PICTURE X.
           02  TITLE02V    PICTURE X.
           02  TITLE02O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURTIMEC    PICTURE X.
           02  CURTIMEP    PICTURE X.
           02  CURTIMEH    PICTURE X.
           02  CURTIMEV    PICTURE X.
           02  CURTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PAGENOC    PICTURE X.
           02  PAGENOP    PICTURE X.
           02  PAGENOH    PICTURE X.
           02  PAGENOV    PICTURE X.
           02  PAGENOO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  ACCTSIDC    PICTURE X.
           02  ACCTSIDP    PICTURE X.
           02  ACCTSIDH    PICTURE X.
           02  ACCTSIDV    PICTURE X.
           02  ACCTSIDO  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CARDSIDC    PICTURE X.
           02  CARDSIDP    PICTURE X.
           02  CARDSIDH    PICTURE X.
           02  CARDSIDV    PICTURE X.
           02  CARDSIDO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSEL1C    PICTURE X.
           02  CRDSEL1P    PICTURE X.
           02  CRDSEL1H    PICTURE X.
           02  CRDSEL1V    PICTURE X.
           02  CRDSEL1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ACCTNO1C    PICTURE X.
           02  ACCTNO1P    PICTURE X.
           02  ACCTNO1H    PICTURE X.
           02  ACCTNO1V    PICTURE X.
           02  ACCTNO1O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CRDNUM1C    PICTURE X.
           02  CRDNUM1P    PICTURE X.
           02  CRDNUM1H    PICTURE X.
           02  CRDNUM1V    PICTURE X.
           02  CRDNUM1O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSTS1C    PICTURE X.
           02  CRDSTS1P    PICTURE X.
           02  CRDSTS1H    PICTURE X.
           02  CRDSTS1V    PICTURE X.
           02  CRDSTS1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSEL2C    PICTURE X.
           02  CRDSEL2P    PICTURE X.
           02  CRDSEL2H    PICTURE X.
           02  CRDSEL2V    PICTURE X.
           02  CRDSEL2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSTP2C    PICTURE X.
           02  CRDSTP2P    PICTURE X.
           02  CRDSTP2H    PICTURE X.
           02  CRDSTP2V    PICTURE X.
           02  CRDSTP2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ACCTNO2C    PICTURE X.
           02  ACCTNO2P    PICTURE X.
           02  ACCTNO2H    PICTURE X.
           02  ACCTNO2V    PICTURE X.
           02  ACCTNO2O  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CRDNUM2C    PICTURE X.
           02  CRDNUM2P    PICTURE X.
           02  CRDNUM2H    PICTURE X.
           02  CRDNUM2V    PICTURE X.
           02  CRDNUM2O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CRDSTS2C    PICTURE X.
           02  CRDSTS2P    PICTURE X.
           02  CRDSTS2H    PICTURE X.
           02  CRDSTS2V    PICTURE X.
           02  CRDSTS2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CRDSEL3C    PICTURE X.
