           02  FILLER REDEFINES ACCTNO5F.
             03 ACCTNO5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTNO5I  PIC X(11).
           02  CRDNUM5L    COMP  PIC  S9(4).
           02  CRDNUM5F    PICTURE X.
           02  FILLER REDEFINES CRDNUM5F.
             03 CRDNUM5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDNUM5I  PIC X(16).
           02  CRDSTS5L    COMP  PIC  S9(4).
           02  CRDSTS5F    PICTURE X.
           02  FILLER REDEFINES CRDSTS5F.
             03 CRDSTS5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTS5I  PIC X(1).
           02  CRDSEL6L    COMP  PIC  S9(4).
           02  CRDSEL6F    PICTURE X.
           02  FILLER REDEFINES CRDSEL6F.
             03 CRDSEL6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSEL6I  PIC X(1).
           02  CRDSTP6L    COMP  PIC  S9(4).
           02  CRDSTP6F    PICTURE X.
           02  FILLER REDEFINES CRDSTP6F.
             03 CRDSTP6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTP6I  PIC X(1).
           02  ACCTNO6L    COMP  PIC  S9(4).
           02  ACCTNO6F    PICTURE X.
           02  FILLER REDEFINES ACCTNO6F.
             03 ACCTNO6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTNO6I  PIC X(11).
           02  CRDNUM6L    COMP  PIC  S9(4).
           02  CRDNUM6F    PICTURE X.
           02  FILLER REDEFINES CRDNUM6F.
             03 CRDNUM6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDNUM6I  PIC X(16).
           02  CRDSTS6L    COMP  PIC  S9(4).
           02  CRDSTS6F    PICTURE X.
           02  FILLER REDEFINES CRDSTS6F.
             03 CRDSTS6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTS6I  PIC X(1).
           02  CRDSEL7L    COMP  PIC  S9(4).
           02  CRDSEL7F    PICTURE X.
           02  FILLER REDEFINES CRDSEL7F.
             03 CRDSEL7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSEL7I  PIC X(1).
           02  CRDSTP7L    COMP  PIC  S9(4).
           02  CRDSTP7F    PICTURE X.
           02  FILLER REDEFINES CRDSTP7F.
             03 CRDSTP7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTP7I  PIC X(1).
           02  ACCTNO7L    COMP  PIC  S9(4).
           02  ACCTNO7F    PICTURE X.
           02  FILLER REDEFINES ACCTNO7F.
             03 ACCTNO7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ACCTNO7I  PIC X(11).
           02  CRDNUM7L    COMP  PIC  S9(4).
           02  CRDNUM7F    PICTURE X.
           02  FILLER REDEFINES CRDNUM7F.
             03 CRDNUM7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDNUM7I  PIC X(16).
           02  CRDSTS7L    COMP  PIC  S9(4).
           02  CRDSTS7F    PICTURE X.
           02  FILLER REDEFINES CRDSTS7F.
             03 CRDSTS7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CRDSTS7I  PIC X(1).
           02  INFOMSGL    COMP  PIC  S9(4).
           02  INFOMSGF    PICTURE X.
           02  FILLER REDEFINES INFOMSGF.
             03 INFOMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  INFOMSGI  PIC X(45).
           02  ERRMSGL    COMP  PIC  S9(4).
           02  ERRMSGF    PICTURE X.
           02  FILLER REDEFINES ERRMSGF.
             03 ERRMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ERRMSGI  PIC X(78).
       01  CCRDLIAO REDEFINES CCRDLIAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  TRNNAMEC    PICTURE X.
           02  TRNNAMEP    PICTURE X.
           02  TRNNAMEH    PICTURE X.
           02  TRNNAMEV    PICTURE X.
           02  TRNNAMEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  TITLE01C    PICTURE X.
           02  TITLE01P    PICTURE X.
           02  TITLE01H    PICTURE X.
