      ******************************************************************
      * Copyright Amazon.com, Inc. or its affiliates.                   
      * All Rights Reserved.                                            
      *                                                                 
      * Licensed under the Apache License, Version 2.0 (the "License"). 
      * You may not use this file except in compliance with the License.
      * You may obtain a copy of the License at                         
      *                                                                 
      *    http://www.apache.org/licenses/LICENSE-2.0                   
      *                                                                 
      * Unless required by applicable law or agreed to in writing,      
      * software distributed under the License is distributed on an     
      * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,    
      * either express or implied. See the License for the specific     
      * language governing permissions and limitations under the License
      ****************************************************************** 
       01  COMEN1AI.
           02  FILLER PIC X(12).
           02  TRNNAMEL    COMP  PIC  S9(4).
           02  TRNNAMEF    PICTURE X.
           02  FILLER REDEFINES TRNNAMEF.
             03 TRNNAMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRNNAMEI  PIC X(4).
           02  TITLE01L    COMP  PIC  S9(4).
           02  TITLE01F    PICTURE X.
           02  FILLER REDEFINES TITLE01F.
             03 TITLE01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TITLE01I  PIC X(40).
           02  CURDATEL    COMP  PIC  S9(4).
           02  CURDATEF    PICTURE X.
           02  FILLER REDEFINES CURDATEF.
             03 CURDATEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CURDATEI  PIC X(8).
           02  PGMNAMEL    COMP  PIC  S9(4).
           02  PGMNAMEF    PICTURE X.
           02  FILLER REDEFINES PGMNAMEF.
             03 PGMNAMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PGMNAMEI  PIC X(8).
           02  TITLE02L    COMP  PIC  S9(4).
           02  TITLE02F    PICTURE X.
           02  FILLER REDEFINES TITLE02F.
             03 TITLE02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TITLE02I  PIC X(40).
           02  CURTIMEL    COMP  PIC  S9(4).
           02  CURTIMEF    PICTURE X.
           02  FILLER REDEFINES CURTIMEF.
             03 CURTIMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CURTIMEI  PIC X(8).
           02  OPTN001L    COMP  PIC  S9(4).
           02  OPTN001F    PICTURE X.
           02  FILLER REDEFINES OPTN001F.
             03 OPTN001A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  OPTN001I  PIC X(40).
           02  OPTN002L    COMP  PIC  S9(4).
           02  OPTN002F    PICTURE X.
           02  FILLER REDEFINES OPTN002F.
             03 OPTN002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  OPTN002I  PIC X(40).
           02  OPTN003L    COMP  PIC  S9(4).
           02  OPTN003F    PICTURE X.
           02  FILLER REDEFINES OPTN003F.
             03 OPTN003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  OPTN003I  PIC X(40).
           02  OPTN004L    COMP  PIC  S9(4).
           02  OPTN004F    PICTURE X.
           02  FILLER REDEFINES OPTN004F.
             03 OPTN004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  OPTN004I  PIC X(40).
           02  OPTN005L    COMP  PIC  S9(4).
           02  OPTN005F    PICTURE X.
           02  FILLER REDEFINES OPTN005F.
             03 OPTN005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  OPTN005I  PIC X(40).
           02  OPTN006L    COMP  PIC  S9(4).
           02  OPTN006F    PICTURE X.
           02  FILLER REDEFINES OPTN006F.
             03 OPTN006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  OPTN006I  PIC X(40).
           02  OPTN007L    COMP  PIC  S9(4).
           02  OPTN007F    PICTURE X.
           02  FILLER REDEFINES OPTN007F.
             03 OPTN007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  OPTN007I  PIC X(40).
           02  OPTN008L    COMP  PIC  S9(4).
           02  OPTN008F    PICTURE X.
           02  FILLER REDEFINES OPTN008F.
             03 OPTN008A    PICTURE X.
