           02  FILLER PICTURE X(3).
           02  OPTN005C    PICTURE X.
           02  OPTN005P    PICTURE X.
           02  OPTN005H    PICTURE X.
           02  OPTN005V    PICTURE X.
           02  OPTN005O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  OPTN006C    PICTURE X.
           02  OPTN006P    PICTURE X.
           02  OPTN006H    PICTURE X.
           02  OPTN006V    PICTURE X.
           02  OPTN006O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  OPTN007C    PICTURE X.
           02  OPTN007P    PICTURE X.
           02  OPTN007H    PICTURE X.
           02  OPTN007V    PICTURE X.
           02  OPTN007O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  OPTN008C    PICTURE X.
           02  OPTN008P    PICTURE X.
           02  OPTN008H    PICTURE X.
           02  OPTN008V    PICTURE X.
           02  OPTN008O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  OPTN009C    PICTURE X.
           02  OPTN009P    PICTURE X.
           02  OPTN009H    PICTURE X.
           02  OPTN009V    PICTURE X.
           02  OPTN009O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  OPTN010C    PICTURE X.
           02  OPTN010P    PICTURE X.
           02  OPTN010H    PICTURE X.
           02  OPTN010V    PICTURE X.
           02  OPTN010O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  OPTN011C    PICTURE X.
           02  OPTN011P    PICTURE X.
           02  OPTN011H    PICTURE X.
           02  OPTN011V    PICTURE X.
           02  OPTN011O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  OPTN012C    PICTURE X.
           02  OPTN012P    PICTURE X.
           02  OPTN012H    PICTURE X.
           02  OPTN012V    PICTURE X.
           02  OPTN012O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  OPTIONC    PICTURE X.
           02  OPTIONP    PICTURE X.
           02  OPTIONH    PICTURE X.
           02  OPTIONV    PICTURE X.
           02  OPTIONO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  ERRMSGC    PICTURE X.
           02  ERRMSGP    PICTURE X.
           02  ERRMSGH    PICTURE X.
           02  ERRMSGV    PICTURE X.
           02  ERRMSGO  PIC X(78).
