           02  FILLER PICTURE X(3).
           02  EDTDDC    PICTURE X.
           02  EDTDDP    PICTURE X.
           02  EDTDDH    PICTURE X.
           02  EDTDDV    PICTURE X.
           02  EDTDDO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  EDTYYYYC    PICTURE X.
           02  EDTYYYYP    PICTURE X.
           02  EDTYYYYH    PICTURE X.
           02  EDTYYYYV    PICTURE X.
           02  EDTYYYYO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  CONFIRMC    PICTURE X.
           02  CONFIRMP    PICTURE X.
           02  CONFIRMH    PICTURE X.
           02  CONFIRMV    PICTURE X.
           02  CONFIRMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ERRMSGC    PICTURE X.
           02  ERRMSGP    PICTURE X.
           02  ERRMSGH    PICTURE X.
           02  ERRMSGV    PICTURE X.
           02  ERRMSGO  PIC X(78).
