           02  FILLER   PICTURE X(4).
           02  EDTDDI  PIC X(2).
           02  EDTYYYYL    COMP  PIC  S9(4).
           02  EDTYYYYF    PICTURE X.
           02  FILLER REDEFINES EDTYYYYF.
             03 EDTYYYYA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  EDTYYYYI  PIC X(4).
           02  CONFIRML    COMP  PIC  S9(4).
           02  CONFIRMF    PICTURE X.
           02  FILLER REDEFINES CONFIRMF.
             03 CONFIRMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CONFIRMI  PIC X(1).
           02  ERRMSGL    COMP  PIC  S9(4).
           02  ERRMSGF    PICTURE X.
           02  FILLER REDEFINES ERRMSGF.
             03 ERRMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ERRMSGI  PIC X(78).
       01  CORPT0AO REDEFINES CORPT0AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  TRNNAMEC    PICTURE X.
           02  TRNNAMEP    PICTURE X.
           02  TRNNAMEH    PICTURE X.
           02  TRNNAMEV    PICTURE X.
           02  TRNNAMEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  TITLE01C    PICTURE X.
           02  TITLE01P    PICTURE X.
           02  TITLE01H    PICTURE X.
           02  TITLE01V    PICTURE X.
           02  TITLE01O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURDATEC    PICTURE X.
           02  CURDATEP    PICTURE X.
           02  CURDATEH    PICTURE X.
           02  CURDATEV    PICTURE X.
           02  CURDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PGMNAMEC    PICTURE X.
           02  PGMNAMEP    PICTURE X.
           02  PGMNAMEH    PICTURE X.
           02  PGMNAMEV    PICTURE X.
           02  PGMNAMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TITLE02C    PICTURE X.
           02  TITLE02P    PICTURE X.
           02  TITLE02H    PICTURE X.
           02  TITLE02V    PICTURE X.
           02  TITLE02O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURTIMEC    PICTURE X.
           02  CURTIMEP    PICTURE X.
           02  CURTIMEH    PICTURE X.
           02  CURTIMEV    PICTURE X.
           02  CURTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  MONTHLYC    PICTURE X.
           02  MONTHLYP    PICTURE X.
           02  MONTHLYH    PICTURE X.
           02  MONTHLYV    PICTURE X.
           02  MONTHLYO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  YEARLYC    PICTURE X.
           02  YEARLYP    PICTURE X.
           02  YEARLYH    PICTURE X.
           02  YEARLYV    PICTURE X.
           02  YEARLYO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  CUSTOMC    PICTURE X.
           02  CUSTOMP    PICTURE X.
           02  CUSTOMH    PICTURE X.
           02  CUSTOMV    PICTURE X.
           02  CUSTOMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SDTMMC    PICTURE X.
           02  SDTMMP    PICTURE X.
           02  SDTMMH    PICTURE X.
           02  SDTMMV    PICTURE X.
           02  SDTMMO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  SDTDDC    PICTURE X.
           02  SDTDDP    PICTURE X.
           02  SDTDDH    PICTURE X.
           02  SDTDDV    PICTURE X.
           02  SDTDDO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  SDTYYYYC    PICTURE X.
           02  SDTYYYYP    PICTURE X.
           02  SDTYYYYH    PICTURE X.
           02  SDTYYYYV    PICTURE X.
           02  SDTYYYYO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  EDTMMC    PICTURE X.
           02  EDTMMP    PICTURE X.
           02  EDTMMH    PICTURE X.
           02  EDTMMV    PICTURE X.
           02  EDTMMO  PIC X(2).
