           02  CURDATEP    PICTURE X.
           02  CURDATEH    PICTURE X.
           02  CURDATEV    PICTURE X.
           02  CURDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PGMNAMEC    PICTURE X.
           02  PGMNAMEP    PICTURE X.
           02  PGMNAMEH    PICTURE X.
           02  PGMNAMEV    PICTURE X.
           02  PGMNAMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TITLE02C    PICTURE X.
           02  TITLE02P    PICTURE X.
           02  TITLE02H    PICTURE X.
           02  TITLE02V    PICTURE X.
           02  TITLE02O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURTIMEC    PICTURE X.
           02  CURTIMEP    PICTURE X.
           02  CURTIMEH    PICTURE X.
           02  CURTIMEV    PICTURE X.
           02  CURTIMEO  PIC X(9).
           02  FILLER PICTURE X(3).
           02  APPLIDC    PICTURE X.
           02  APPLIDP    PICTURE X.
           02  APPLIDH    PICTURE X.
           02  APPLIDV    PICTURE X.
           02  APPLIDO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  SYSIDC    PICTURE X.
           02  SYSIDP    PICTURE X.
           02  SYSIDH    PICTURE X.
           02  SYSIDV    PICTURE X.
           02  SYSIDO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  USERIDC    PICTURE X.
           02  USERIDP    PICTURE X.
           02  USERIDH    PICTURE X.
           02  USERIDV    PICTURE X.
           02  USERIDO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PASSWDC    PICTURE X.
           02  PASSWDP    PICTURE X.
           02  PASSWDH    PICTURE X.
           02  PASSWDV    PICTURE X.
           02  PASSWDO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ERRMSGC    PICTURE X.
           02  ERRMSGP    PICTURE X.
           02  ERRMSGH    PICTURE X.
           02  ERRMSGV    PICTURE X.
           02  ERRMSGO  PIC X(78).
