           02  FILLER   PICTURE X(4).
           02  TORIGDTI  PIC X(10).
           02  TPROCDTL    COMP  PIC  S9(4).
           02  TPROCDTF    PICTURE X.
           02  FILLER REDEFINES TPROCDTF.
             03 TPROCDTA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TPROCDTI  PIC X(10).
           02  MIDL    COMP  PIC  S9(4).
           02  MIDF    PICTURE X.
           02  FILLER REDEFINES MIDF.
             03 MIDA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MIDI  PIC X(9).
           02  MNAMEL    COMP  PIC  S9(4).
           02  MNAMEF    PICTURE X.
           02  FILLER REDEFINES MNAMEF.
             03 MNAMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MNAMEI  PIC X(30).
           02  MCITYL    COMP  PIC  S9(4).
           02  MCITYF    PICTURE X.
           02  FILLER REDEFINES MCITYF.
             03 MCITYA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MCITYI  PIC X(25).
           02  MZIPL    COMP  PIC  S9(4).
           02  MZIPF    PICTURE X.
           02  FILLER REDEFINES MZIPF.
             03 MZIPA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  MZIPI  PIC X(10).
           02  CONFIRML    COMP  PIC  S9(4).
           02  CONFIRMF    PICTURE X.
           02  FILLER REDEFINES CONFIRMF.
             03 CONFIRMA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CONFIRMI  PIC X(1).
           02  ERRMSGL    COMP  PIC  S9(4).
           02  ERRMSGF    PICTURE X.
           02  FILLER REDEFINES ERRMSGF.
             03 ERRMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ERRMSGI  PIC X(78).
       01  COTRN2AO REDEFINES COTRN2AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  TRNNAMEC    PICTURE X.
           02  TRNNAMEP    PICTURE X.
           02  TRNNAMEH    PICTURE X.
           02  TRNNAMEV    PICTURE X.
           02  TRNNAMEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  TITLE01C    PICTURE X.
           02  TITLE01P    PICTURE X.
           02  TITLE01H    PICTURE X.
           02  TITLE01V    PICTURE X.
           02  TITLE01O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURDATEC    PICTURE X.
           02  CURDATEP    PICTURE X.
           02  CURDATEH    PICTURE X.
           02  CURDATEV    PICTURE X.
           02  CURDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PGMNAMEC    PICTURE X.
           02  PGMNAMEP    PICTURE X.
           02  PGMNAMEH    PICTURE X.
           02  PGMNAMEV    PICTURE X.
           02  PGMNAMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TITLE02C    PICTURE X.
           02  TITLE02P    PICTURE X.
           02  TITLE02H    PICTURE X.
           02  TITLE02V    PICTURE X.
           02  TITLE02O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURTIMEC    PICTURE X.
           02  CURTIMEP    PICTURE X.
           02  CURTIMEH    PICTURE X.
           02  CURTIMEV    PICTURE X.
           02  CURTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  ACTIDINC    PICTURE X.
           02  ACTIDINP    PICTURE X.
           02  ACTIDINH    PICTURE X.
           02  ACTIDINV    PICTURE X.
           02  ACTIDINO  PIC X(11).
           02  FILLER PICTURE X(3).
           02  CARDNINC    PICTURE X.
           02  CARDNINP    PICTURE X.
           02  CARDNINH    PICTURE X.
           02  CARDNINV    PICTURE X.
           02  CARDNINO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  TTYPCDC    PICTURE X.
           02  TTYPCDP    PICTURE X.
           02  TTYPCDH    PICTURE X.
           02  TTYPCDV    PICTURE X.
           02  TTYPCDO  PIC X(2).
