           02  TITLE02P    PICTURE X.
           02  TITLE02H    PICTURE X.
           02  TITLE02V    PICTURE X.
           02  TITLE02O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURTIMEC    PICTURE X.
           02  CURTIMEP    PICTURE X.
           02  CURTIMEH    PICTURE X.
           02  CURTIMEV    PICTURE X.
           02  CURTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PAGENUMC    PICTURE X.
           02  PAGENUMP    PICTURE X.
           02  PAGENUMH    PICTURE X.
           02  PAGENUMV    PICTURE X.
           02  PAGENUMO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TRNIDINC    PICTURE X.
           02  TRNIDINP    PICTURE X.
           02  TRNIDINH    PICTURE X.
           02  TRNIDINV    PICTURE X.
           02  TRNIDINO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  SEL0001C    PICTURE X.
           02  SEL0001P    PICTURE X.
           02  SEL0001H    PICTURE X.
           02  SEL0001V    PICTURE X.
           02  SEL0001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  TRNID01C    PICTURE X.
           02  TRNID01P    PICTURE X.
           02  TRNID01H    PICTURE X.
           02  TRNID01V    PICTURE X.
           02  TRNID01O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  TDATE01C    PICTURE X.
           02  TDATE01P    PICTURE X.
           02  TDATE01H    PICTURE X.
           02  TDATE01V    PICTURE X.
           02  TDATE01O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TDESC01C    PICTURE X.
           02  TDESC01P    PICTURE X.
           02  TDESC01H    PICTURE X.
           02  TDESC01V    PICTURE X.
           02  TDESC01O  PIC X(26).
           02  FILLER PICTURE X(3).
           02  TAMT001C    PICTURE X.
           02  TAMT001P    PICTURE X.
           02  TAMT001H    PICTURE X.
           02  TAMT001V    PICTURE X.
           02  TAMT001O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  SEL0002C    PICTURE X.
           02  SEL0002P    PICTURE X.
           02  SEL0002H    PICTURE X.
           02  SEL0002V    PICTURE X.
           02  SEL0002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  TRNID02C    PICTURE X.
           02  TRNID02P    PICTURE X.
           02  TRNID02H    PICTURE X.
           02  TRNID02V    PICTURE X.
           02  TRNID02O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  TDATE02C    PICTURE X.
           02  TDATE02P    PICTURE X.
           02  TDATE02H    PICTURE X.
           02  TDATE02V    PICTURE X.
           02  TDATE02O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TDESC02C    PICTURE X.
           02  TDESC02P    PICTURE X.
           02  TDESC02H    PICTURE X.
           02  TDESC02V    PICTURE X.
           02  TDESC02O  PIC X(26).
           02  FILLER PICTURE X(3).
           02  TAMT002C    PICTURE X.
           02  TAMT002P    PICTURE X.
           02  TAMT002H    PICTURE X.
           02  TAMT002V    PICTURE X.
           02  TAMT002O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  SEL0003C    PICTURE X.
           02  SEL0003P    PICTURE X.
           02  SEL0003H    PICTURE X.
           02  SEL0003V    PICTURE X.
           02  SEL0003O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  TRNID03C    PICTURE X.
           02  TRNID03P    PICTURE X.
           02  TRNID03H    PICTURE X.
           02  TRNID03V    PICTURE X.
           02  TRNID03O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  TDATE03C    PICTURE X.
           02  TDATE03P    PICTURE X.
           02  TDATE03H    PICTURE X.
           02  TDATE03V    PICTURE X.
           02  TDATE03O  PIC X(8).
