           02  FILLER   PICTURE X(4).
           02  SEL0002I  PIC X(1).
           02  TRNID02L    COMP  PIC  S9(4).
           02  TRNID02F    PICTURE X.
           02  FILLER REDEFINES TRNID02F.
             03 TRNID02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRNID02I  PIC X(16).
           02  TDATE02L    COMP  PIC  S9(4).
           02  TDATE02F    PICTURE X.
           02  FILLER REDEFINES TDATE02F.
             03 TDATE02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDATE02I  PIC X(8).
           02  TDESC02L    COMP  PIC  S9(4).
           02  TDESC02F    PICTURE X.
           02  FILLER REDEFINES TDESC02F.
             03 TDESC02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDESC02I  PIC X(26).
           02  TAMT002L    COMP  PIC  S9(4).
           02  TAMT002F    PICTURE X.
           02  FILLER REDEFINES TAMT002F.
             03 TAMT002A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TAMT002I  PIC X(12).
           02  SEL0003L    COMP  PIC  S9(4).
           02  SEL0003F    PICTURE X.
           02  FILLER REDEFINES SEL0003F.
             03 SEL0003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SEL0003I  PIC X(1).
           02  TRNID03L    COMP  PIC  S9(4).
           02  TRNID03F    PICTURE X.
           02  FILLER REDEFINES TRNID03F.
             03 TRNID03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRNID03I  PIC X(16).
           02  TDATE03L    COMP  PIC  S9(4).
           02  TDATE03F    PICTURE X.
           02  FILLER REDEFINES TDATE03F.
             03 TDATE03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDATE03I  PIC X(8).
           02  TDESC03L    COMP  PIC  S9(4).
           02  TDESC03F    PICTURE X.
           02  FILLER REDEFINES TDESC03F.
             03 TDESC03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDESC03I  PIC X(26).
           02  TAMT003L    COMP  PIC  S9(4).
           02  TAMT003F    PICTURE X.
           02  FILLER REDEFINES TAMT003F.
             03 TAMT003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TAMT003I  PIC X(12).
           02  SEL0004L    COMP  PIC  S9(4).
           02  SEL0004F    PICTURE X.
           02  FILLER REDEFINES SEL0004F.
             03 SEL0004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SEL0004I  PIC X(1).
           02  TRNID04L    COMP  PIC  S9(4).
           02  TRNID04F    PICTURE X.
           02  FILLER REDEFINES TRNID04F.
             03 TRNID04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRNID04I  PIC X(16).
           02  TDATE04L    COMP  PIC  S9(4).
           02  TDATE04F    PICTURE X.
           02  FILLER REDEFINES TDATE04F.
             03 TDATE04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDATE04I  PIC X(8).
           02  TDESC04L    COMP  PIC  S9(4).
           02  TDESC04F    PICTURE X.
           02  FILLER REDEFINES TDESC04F.
             03 TDESC04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDESC04I  PIC X(26).
           02  TAMT004L    COMP  PIC  S9(4).
           02  TAMT004F    PICTURE X.
           02  FILLER REDEFINES TAMT004F.
             03 TAMT004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TAMT004I  PIC X(12).
           02  SEL0005L    COMP  PIC  S9(4).
           02  SEL0005F    PICTURE X.
           02  FILLER REDEFINES SEL0005F.
             03 SEL0005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SEL0005I  PIC X(1).
           02  TRNID05L    COMP  PIC  S9(4).
           02  TRNID05F    PICTURE X.
           02  FILLER REDEFINES TRNID05F.
             03 TRNID05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRNID05I  PIC X(16).
           02  TDATE05L    COMP  PIC  S9(4).
           02  TDATE05F    PICTURE X.
