           02  TAMT006V    PICTURE X.
           02  TAMT006O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  SEL0007C    PICTURE X.
           02  SEL0007P    PICTURE X.
           02  SEL0007H    PICTURE X.
           02  SEL0007V    PICTURE X.
           02  SEL0007O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  TRNID07C    PICTURE X.
           02  TRNID07P    PICTURE X.
           02  TRNID07H    PICTURE X.
           02  TRNID07V    PICTURE X.
           02  TRNID07O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  TDATE07C    PICTURE X.
           02  TDATE07P    PICTURE X.
           02  TDATE07H    PICTURE X.
           02  TDATE07V    PICTURE X.
           02  TDATE07O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TDESC07C    PICTURE X.
           02  TDESC07P    PICTURE X.
           02  TDESC07H    PICTURE X.
           02  TDESC07V    PICTURE X.
           02  TDESC07O  PIC X(26).
           02  FILLER PICTURE X(3).
           02  TAMT007C    PICTURE X.
           02  TAMT007P    PICTURE X.
           02  TAMT007H    PICTURE X.
           02  TAMT007V    PICTURE X.
           02  TAMT007O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  SEL0008C    PICTURE X.
           02  SEL0008P    PICTURE X.
           02  SEL0008H    PICTURE X.
           02  SEL0008V    PICTURE X.
           02  SEL0008O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  TRNID08C    PICTURE X.
           02  TRNID08P    PICTURE X.
           02  TRNID08H    PICTURE X.
           02  TRNID08V    PICTURE X.
           02  TRNID08O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  TDATE08C    PICTURE X.
           02  TDATE08P    PICTURE X.
           02  TDATE08H    PICTURE X.
           02  TDATE08V    PICTURE X.
           02  TDATE08O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TDESC08C    PICTURE X.
           02  TDESC08P    PICTURE X.
           02  TDESC08H    PICTURE X.
           02  TDESC08V    PICTURE X.
           02  TDESC08O  PIC X(26).
           02  FILLER PICTURE X(3).
           02  TAMT008C    PICTURE X.
           02  TAMT008P    PICTURE X.
           02  TAMT008H    PICTURE X.
           02  TAMT008V    PICTURE X.
           02  TAMT008O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  SEL0009C    PICTURE X.
           02  SEL0009P    PICTURE X.
           02  SEL0009H    PICTURE X.
           02  SEL0009V    PICTURE X.
           02  SEL0009O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  TRNID09C    PICTURE X.
           02  TRNID09P    PICTURE X.
           02  TRNID09H    PICTURE X.
           02  TRNID09V    PICTURE X.
           02  TRNID09O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  TDATE09C    PICTURE X.
           02  TDATE09P    PICTURE X.
           02  TDATE09H    PICTURE X.
           02  TDATE09V    PICTURE X.
           02  TDATE09O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TDESC09C    PICTURE X.
           02  TDESC09P    PICTURE X.
           02  TDESC09H    PICTURE X.
           02  TDESC09V    PICTURE X.
           02  TDESC09O  PIC X(26).
           02  FILLER PICTURE X(3).
           02  TAMT009C    PICTURE X.
           02  TAMT009P    PICTURE X.
           02  TAMT009H    PICTURE X.
           02  TAMT009V    PICTURE X.
           02  TAMT009O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  SEL0010C    PICTURE X.
           02  SEL0010P    PICTURE X.
           02  SEL0010H    PICTURE X.
           02  SEL0010V    PICTURE X.
           02  SEL0010O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  TRNID10C    PICTURE X.
