           02  TRNID10P    PICTURE X.
           02  TRNID10H    PICTURE X.
           02  TRNID10V    PICTURE X.
           02  TRNID10O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  TDATE10C    PICTURE X.
           02  TDATE10P    PICTURE X.
           02  TDATE10H    PICTURE X.
           02  TDATE10V    PICTURE X.
           02  TDATE10O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TDESC10C    PICTURE X.
           02  TDESC10P    PICTURE X.
           02  TDESC10H    PICTURE X.
           02  TDESC10V    PICTURE X.
           02  TDESC10O  PIC X(26).
           02  FILLER PICTURE X(3).
           02  TAMT010C    PICTURE X.
           02  TAMT010P    PICTURE X.
           02  TAMT010H    PICTURE X.
           02  TAMT010V    PICTURE X.
           02  TAMT010O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  ERRMSGC    PICTURE X.
           02  ERRMSGP    PICTURE X.
           02  ERRMSGH    PICTURE X.
           02  ERRMSGV    PICTURE X.
           02  ERRMSGO  PIC X(78).
