           02  FILLER REDEFINES TDATE05F.
             03 TDATE05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDATE05I  PIC X(8).
           02  TDESC05L    COMP  PIC  S9(4).
           02  TDESC05F    PICTURE X.
           02  FILLER REDEFINES TDESC05F.
             03 TDESC05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDESC05I  PIC X(26).
           02  TAMT005L    COMP  PIC  S9(4).
           02  TAMT005F    PICTURE X.
           02  FILLER REDEFINES TAMT005F.
             03 TAMT005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TAMT005I  PIC X(12).
           02  SEL0006L    COMP  PIC  S9(4).
           02  SEL0006F    PICTURE X.
           02  FILLER REDEFINES SEL0006F.
             03 SEL0006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SEL0006I  PIC X(1).
           02  TRNID06L    COMP  PIC  S9(4).
           02  TRNID06F    PICTURE X.
           02  FILLER REDEFINES TRNID06F.
             03 TRNID06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRNID06I  PIC X(16).
           02  TDATE06L    COMP  PIC  S9(4).
           02  TDATE06F    PICTURE X.
           02  FILLER REDEFINES TDATE06F.
             03 TDATE06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDATE06I  PIC X(8).
           02  TDESC06L    COMP  PIC  S9(4).
           02  TDESC06F    PICTURE X.
           02  FILLER REDEFINES TDESC06F.
             03 TDESC06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDESC06I  PIC X(26).
           02  TAMT006L    COMP  PIC  S9(4).
           02  TAMT006F    PICTURE X.
           02  FILLER REDEFINES TAMT006F.
             03 TAMT006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TAMT006I  PIC X(12).
           02  SEL0007L    COMP  PIC  S9(4).
           02  SEL0007F    PICTURE X.
           02  FILLER REDEFINES SEL0007F.
             03 SEL0007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SEL0007I  PIC X(1).
           02  TRNID07L    COMP  PIC  S9(4).
           02  TRNID07F    PICTURE X.
           02  FILLER REDEFINES TRNID07F.
             03 TRNID07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRNID07I  PIC X(16).
           02  TDATE07L    COMP  PIC  S9(4).
           02  TDATE07F    PICTURE X.
           02  FILLER REDEFINES TDATE07F.
             03 TDATE07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDATE07I  PIC X(8).
           02  TDESC07L    COMP  PIC  S9(4).
           02  TDESC07F    PICTURE X.
           02  FILLER REDEFINES TDESC07F.
             03 TDESC07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDESC07I  PIC X(26).
           02  TAMT007L    COMP  PIC  S9(4).
           02  TAMT007F    PICTURE X.
           02  FILLER REDEFINES TAMT007F.
             03 TAMT007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TAMT007I  PIC X(12).
           02  SEL0008L    COMP  PIC  S9(4).
           02  SEL0008F    PICTURE X.
           02  FILLER REDEFINES SEL0008F.
             03 SEL0008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SEL0008I  PIC X(1).
           02  TRNID08L    COMP  PIC  S9(4).
           02  TRNID08F    PICTURE X.
           02  FILLER REDEFINES TRNID08F.
             03 TRNID08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRNID08I  PIC X(16).
           02  TDATE08L    COMP  PIC  S9(4).
           02  TDATE08F    PICTURE X.
           02  FILLER REDEFINES TDATE08F.
             03 TDATE08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDATE08I  PIC X(8).
           02  TDESC08L    COMP  PIC  S9(4).
           02  TDESC08F    PICTURE X.
           02  FILLER REDEFINES TDESC08F.
             03 TDESC08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDESC08I  PIC X(26).
