           02  TAMT008L    COMP  PIC  S9(4).
           02  TAMT008F    PICTURE X.
           02  FILLER REDEFINES TAMT008F.
             03 TAMT008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TAMT008I  PIC X(12).
           02  SEL0009L    COMP  PIC  S9(4).
           02  SEL0009F    PICTURE X.
           02  FILLER REDEFINES SEL0009F.
             03 SEL0009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SEL0009I  PIC X(1).
           02  TRNID09L    COMP  PIC  S9(4).
           02  TRNID09F    PICTURE X.
           02  FILLER REDEFINES TRNID09F.
             03 TRNID09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRNID09I  PIC X(16).
           02  TDATE09L    COMP  PIC  S9(4).
           02  TDATE09F    PICTURE X.
           02  FILLER REDEFINES TDATE09F.
             03 TDATE09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDATE09I  PIC X(8).
           02  TDESC09L    COMP  PIC  S9(4).
           02  TDESC09F    PICTURE X.
           02  FILLER REDEFINES TDESC09F.
             03 TDESC09A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDESC09I  PIC X(26).
           02  TAMT009L    COMP  PIC  S9(4).
           02  TAMT009F    PICTURE X.
           02  FILLER REDEFINES TAMT009F.
             03 TAMT009A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TAMT009I  PIC X(12).
           02  SEL0010L    COMP  PIC  S9(4).
           02  SEL0010F    PICTURE X.
           02  FILLER REDEFINES SEL0010F.
             03 SEL0010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SEL0010I  PIC X(1).
           02  TRNID10L    COMP  PIC  S9(4).
           02  TRNID10F    PICTURE X.
           02  FILLER REDEFINES TRNID10F.
             03 TRNID10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRNID10I  PIC X(16).
           02  TDATE10L    COMP  PIC  S9(4).
           02  TDATE10F    PICTURE X.
           02  FILLER REDEFINES TDATE10F.
             03 TDATE10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDATE10I  PIC X(8).
           02  TDESC10L    COMP  PIC  S9(4).
           02  TDESC10F    PICTURE X.
           02  FILLER REDEFINES TDESC10F.
             03 TDESC10A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TDESC10I  PIC X(26).
           02  TAMT010L    COMP  PIC  S9(4).
           02  TAMT010F    PICTURE X.
           02  FILLER REDEFINES TAMT010F.
             03 TAMT010A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TAMT010I  PIC X(12).
           02  ERRMSGL    COMP  PIC  S9(4).
           02  ERRMSGF    PICTURE X.
           02  FILLER REDEFINES ERRMSGF.
             03 ERRMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ERRMSGI  PIC X(78).
       01  COTRN0AO REDEFINES COTRN0AI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  TRNNAMEC    PICTURE X.
           02  TRNNAMEP    PICTURE X.
           02  TRNNAMEH    PICTURE X.
           02  TRNNAMEV    PICTURE X.
           02  TRNNAMEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  TITLE01C    PICTURE X.
           02  TITLE01P    PICTURE X.
           02  TITLE01H    PICTURE X.
           02  TITLE01V    PICTURE X.
           02  TITLE01O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURDATEC    PICTURE X.
           02  CURDATEP    PICTURE X.
           02  CURDATEH    PICTURE X.
           02  CURDATEV    PICTURE X.
           02  CURDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PGMNAMEC    PICTURE X.
           02  PGMNAMEP    PICTURE X.
           02  PGMNAMEH    PICTURE X.
           02  PGMNAMEV    PICTURE X.
           02  PGMNAMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TITLE02C    PICTURE X.
