           02  FILLER PICTURE X(3).
           02  TDESC03C    PICTURE X.
           02  TDESC03P    PICTURE X.
           02  TDESC03H    PICTURE X.
           02  TDESC03V    PICTURE X.
           02  TDESC03O  PIC X(26).
           02  FILLER PICTURE X(3).
           02  TAMT003C    PICTURE X.
           02  TAMT003P    PICTURE X.
           02  TAMT003H    PICTURE X.
           02  TAMT003V    PICTURE X.
           02  TAMT003O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  SEL0004C    PICTURE X.
           02  SEL0004P    PICTURE X.
           02  SEL0004H    PICTURE X.
           02  SEL0004V    PICTURE X.
           02  SEL0004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  TRNID04C    PICTURE X.
           02  TRNID04P    PICTURE X.
           02  TRNID04H    PICTURE X.
           02  TRNID04V    PICTURE X.
           02  TRNID04O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  TDATE04C    PICTURE X.
           02  TDATE04P    PICTURE X.
           02  TDATE04H    PICTURE X.
           02  TDATE04V    PICTURE X.
           02  TDATE04O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TDESC04C    PICTURE X.
           02  TDESC04P    PICTURE X.
           02  TDESC04H    PICTURE X.
           02  TDESC04V    PICTURE X.
           02  TDESC04O  PIC X(26).
           02  FILLER PICTURE X(3).
           02  TAMT004C    PICTURE X.
           02  TAMT004P    PICTURE X.
           02  TAMT004H    PICTURE X.
           02  TAMT004V    PICTURE X.
           02  TAMT004O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  SEL0005C    PICTURE X.
           02  SEL0005P    PICTURE X.
           02  SEL0005H    PICTURE X.
           02  SEL0005V    PICTURE X.
           02  SEL0005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  TRNID05C    PICTURE X.
           02  TRNID05P    PICTURE X.
           02  TRNID05H    PICTURE X.
           02  TRNID05V    PICTURE X.
           02  TRNID05O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  TDATE05C    PICTURE X.
           02  TDATE05P    PICTURE X.
           02  TDATE05H    PICTURE X.
           02  TDATE05V    PICTURE X.
           02  TDATE05O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TDESC05C    PICTURE X.
           02  TDESC05P    PICTURE X.
           02  TDESC05H    PICTURE X.
           02  TDESC05V    PICTURE X.
           02  TDESC05O  PIC X(26).
           02  FILLER PICTURE X(3).
           02  TAMT005C    PICTURE X.
           02  TAMT005P    PICTURE X.
           02  TAMT005H    PICTURE X.
           02  TAMT005V    PICTURE X.
           02  TAMT005O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  SEL0006C    PICTURE X.
           02  SEL0006P    PICTURE X.
           02  SEL0006H    PICTURE X.
           02  SEL0006V    PICTURE X.
           02  SEL0006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  TRNID06C    PICTURE X.
           02  TRNID06P    PICTURE X.
           02  TRNID06H    PICTURE X.
           02  TRNID06V    PICTURE X.
           02  TRNID06O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  TDATE06C    PICTURE X.
           02  TDATE06P    PICTURE X.
           02  TDATE06H    PICTURE X.
           02  TDATE06V    PICTURE X.
           02  TDATE06O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TDESC06C    PICTURE X.
           02  TDESC06P    PICTURE X.
           02  TDESC06H    PICTURE X.
           02  TDESC06V    PICTURE X.
           02  TDESC06O  PIC X(26).
           02  FILLER PICTURE X(3).
           02  TAMT006C    PICTURE X.
           02  TAMT006P    PICTURE X.
           02  TAMT006H    PICTURE X.
