           02  FILLER PICTURE X(3).
           02  TCATCDC    PICTURE X.
           02  TCATCDP    PICTURE X.
           02  TCATCDH    PICTURE X.
           02  TCATCDV    PICTURE X.
           02  TCATCDO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  TRNSRCC    PICTURE X.
           02  TRNSRCP    PICTURE X.
           02  TRNSRCH    PICTURE X.
           02  TRNSRCV    PICTURE X.
           02  TRNSRCO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  TDESCC    PICTURE X.
           02  TDESCP    PICTURE X.
           02  TDESCH    PICTURE X.
           02  TDESCV    PICTURE X.
           02  TDESCO  PIC X(60).
           02  FILLER PICTURE X(3).
           02  TRNAMTC    PICTURE X.
           02  TRNAMTP    PICTURE X.
           02  TRNAMTH    PICTURE X.
           02  TRNAMTV    PICTURE X.
           02  TRNAMTO  PIC X(12).
           02  FILLER PICTURE X(3).
           02  TORIGDTC    PICTURE X.
           02  TORIGDTP    PICTURE X.
           02  TORIGDTH    PICTURE X.
           02  TORIGDTV    PICTURE X.
           02  TORIGDTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  TPROCDTC    PICTURE X.
           02  TPROCDTP    PICTURE X.
           02  TPROCDTH    PICTURE X.
           02  TPROCDTV    PICTURE X.
           02  TPROCDTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MIDC    PICTURE X.
           02  MIDP    PICTURE X.
           02  MIDH    PICTURE X.
           02  MIDV    PICTURE X.
           02  MIDO  PIC X(9).
           02  FILLER PICTURE X(3).
           02  MNAMEC    PICTURE X.
           02  MNAMEP    PICTURE X.
           02  MNAMEH    PICTURE X.
           02  MNAMEV    PICTURE X.
           02  MNAMEO  PIC X(30).
           02  FILLER PICTURE X(3).
           02  MCITYC    PICTURE X.
           02  MCITYP    PICTURE X.
           02  MCITYH    PICTURE X.
           02  MCITYV    PICTURE X.
           02  MCITYO  PIC X(25).
           02  FILLER PICTURE X(3).
           02  MZIPC    PICTURE X.
           02  MZIPP    PICTURE X.
           02  MZIPH    PICTURE X.
           02  MZIPV    PICTURE X.
           02  MZIPO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  CONFIRMC    PICTURE X.
           02  CONFIRMP    PICTURE X.
           02  CONFIRMH    PICTURE X.
           02  CONFIRMV    PICTURE X.
           02  CONFIRMO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ERRMSGC    PICTURE X.
           02  ERRMSGP    PICTURE X.
           02  ERRMSGH    PICTURE X.
           02  ERRMSGV    PICTURE X.
           02  ERRMSGO  PIC X(78).
