           02  TITLE01P    PICTURE X.
           02  TITLE01H    PICTURE X.
           02  TITLE01V    PICTURE X.
           02  TITLE01O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURDATEC    PICTURE X.
           02  CURDATEP    PICTURE X.
           02  CURDATEH    PICTURE X.
           02  CURDATEV    PICTURE X.
           02  CURDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PGMNAMEC    PICTURE X.
           02  PGMNAMEP    PICTURE X.
           02  PGMNAMEH    PICTURE X.
           02  PGMNAMEV    PICTURE X.
           02  PGMNAMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TITLE02C    PICTURE X.
           02  TITLE02P    PICTURE X.
           02  TITLE02H    PICTURE X.
           02  TITLE02V    PICTURE X.
           02  TITLE02O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURTIMEC    PICTURE X.
           02  CURTIMEP    PICTURE X.
           02  CURTIMEH    PICTURE X.
           02  CURTIMEV    PICTURE X.
           02  CURTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  USRIDINC    PICTURE X.
           02  USRIDINP    PICTURE X.
           02  USRIDINH    PICTURE X.
           02  USRIDINV    PICTURE X.
           02  USRIDINO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FNAMEC    PICTURE X.
           02  FNAMEP    PICTURE X.
           02  FNAMEH    PICTURE X.
           02  FNAMEV    PICTURE X.
           02  FNAMEO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  LNAMEC    PICTURE X.
           02  LNAMEP    PICTURE X.
           02  LNAMEH    PICTURE X.
           02  LNAMEV    PICTURE X.
           02  LNAMEO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  PASSWDC    PICTURE X.
           02  PASSWDP    PICTURE X.
           02  PASSWDH    PICTURE X.
           02  PASSWDV    PICTURE X.
           02  PASSWDO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  USRTYPEC    PICTURE X.
           02  USRTYPEP    PICTURE X.
           02  USRTYPEH    PICTURE X.
           02  USRTYPEV    PICTURE X.
           02  USRTYPEO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ERRMSGC    PICTURE X.
           02  ERRMSGP    PICTURE X.
           02  ERRMSGH    PICTURE X.
           02  ERRMSGV    PICTURE X.
           02  ERRMSGO  PIC X(78).
