           02  FILLER   PICTURE X(4).
           02  SEL0002I  PIC X(1).
           02  USRID02L    COMP  PIC  S9(4).
           02  USRID02F    PICTURE X.
           02  FILLER REDEFINES USRID02F.
             03 USRID02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  USRID02I  PIC X(8).
           02  FNAME02L    COMP  PIC  S9(4).
           02  FNAME02F    PICTURE X.
           02  FILLER REDEFINES FNAME02F.
             03 FNAME02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FNAME02I  PIC X(20).
           02  LNAME02L    COMP  PIC  S9(4).
           02  LNAME02F    PICTURE X.
           02  FILLER REDEFINES LNAME02F.
             03 LNAME02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LNAME02I  PIC X(20).
           02  UTYPE02L    COMP  PIC  S9(4).
           02  UTYPE02F    PICTURE X.
           02  FILLER REDEFINES UTYPE02F.
             03 UTYPE02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  UTYPE02I  PIC X(1).
           02  SEL0003L    COMP  PIC  S9(4).
           02  SEL0003F    PICTURE X.
           02  FILLER REDEFINES SEL0003F.
             03 SEL0003A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SEL0003I  PIC X(1).
           02  USRID03L    COMP  PIC  S9(4).
           02  USRID03F    PICTURE X.
           02  FILLER REDEFINES USRID03F.
             03 USRID03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  USRID03I  PIC X(8).
           02  FNAME03L    COMP  PIC  S9(4).
           02  FNAME03F    PICTURE X.
           02  FILLER REDEFINES FNAME03F.
             03 FNAME03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FNAME03I  PIC X(20).
           02  LNAME03L    COMP  PIC  S9(4).
           02  LNAME03F    PICTURE X.
           02  FILLER REDEFINES LNAME03F.
             03 LNAME03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LNAME03I  PIC X(20).
           02  UTYPE03L    COMP  PIC  S9(4).
           02  UTYPE03F    PICTURE X.
           02  FILLER REDEFINES UTYPE03F.
             03 UTYPE03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  UTYPE03I  PIC X(1).
           02  SEL0004L    COMP  PIC  S9(4).
           02  SEL0004F    PICTURE X.
           02  FILLER REDEFINES SEL0004F.
             03 SEL0004A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SEL0004I  PIC X(1).
           02  USRID04L    COMP  PIC  S9(4).
           02  USRID04F    PICTURE X.
           02  FILLER REDEFINES USRID04F.
             03 USRID04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  USRID04I  PIC X(8).
           02  FNAME04L    COMP  PIC  S9(4).
           02  FNAME04F    PICTURE X.
           02  FILLER REDEFINES FNAME04F.
             03 FNAME04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FNAME04I  PIC X(20).
           02  LNAME04L    COMP  PIC  S9(4).
           02  LNAME04F    PICTURE X.
           02  FILLER REDEFINES LNAME04F.
             03 LNAME04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LNAME04I  PIC X(20).
           02  UTYPE04L    COMP  PIC  S9(4).
           02  UTYPE04F    PICTURE X.
           02  FILLER REDEFINES UTYPE04F.
             03 UTYPE04A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  UTYPE04I  PIC X(1).
           02  SEL0005L    COMP  PIC  S9(4).
           02  SEL0005F    PICTURE X.
           02  FILLER REDEFINES SEL0005F.
             03 SEL0005A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SEL0005I  PIC X(1).
           02  USRID05L    COMP  PIC  S9(4).
           02  USRID05F    PICTURE X.
           02  FILLER REDEFINES USRID05F.
             03 USRID05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  USRID05I  PIC X(8).
           02  FNAME05L    COMP  PIC  S9(4).
           02  FNAME05F    PICTURE X.
