           02  FILLER REDEFINES FNAME05F.
             03 FNAME05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FNAME05I  PIC X(20).
           02  LNAME05L    COMP  PIC  S9(4).
           02  LNAME05F    PICTURE X.
           02  FILLER REDEFINES LNAME05F.
             03 LNAME05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LNAME05I  PIC X(20).
           02  UTYPE05L    COMP  PIC  S9(4).
           02  UTYPE05F    PICTURE X.
           02  FILLER REDEFINES UTYPE05F.
             03 UTYPE05A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  UTYPE05I  PIC X(1).
           02  SEL0006L    COMP  PIC  S9(4).
           02  SEL0006F    PICTURE X.
           02  FILLER REDEFINES SEL0006F.
             03 SEL0006A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SEL0006I  PIC X(1).
           02  USRID06L    COMP  PIC  S9(4).
           02  USRID06F    PICTURE X.
           02  FILLER REDEFINES USRID06F.
             03 USRID06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  USRID06I  PIC X(8).
           02  FNAME06L    COMP  PIC  S9(4).
           02  FNAME06F    PICTURE X.
           02  FILLER REDEFINES FNAME06F.
             03 FNAME06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FNAME06I  PIC X(20).
           02  LNAME06L    COMP  PIC  S9(4).
           02  LNAME06F    PICTURE X.
           02  FILLER REDEFINES LNAME06F.
             03 LNAME06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LNAME06I  PIC X(20).
           02  UTYPE06L    COMP  PIC  S9(4).
           02  UTYPE06F    PICTURE X.
           02  FILLER REDEFINES UTYPE06F.
             03 UTYPE06A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  UTYPE06I  PIC X(1).
           02  SEL0007L    COMP  PIC  S9(4).
           02  SEL0007F    PICTURE X.
           02  FILLER REDEFINES SEL0007F.
             03 SEL0007A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SEL0007I  PIC X(1).
           02  USRID07L    COMP  PIC  S9(4).
           02  USRID07F    PICTURE X.
           02  FILLER REDEFINES USRID07F.
             03 USRID07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  USRID07I  PIC X(8).
           02  FNAME07L    COMP  PIC  S9(4).
           02  FNAME07F    PICTURE X.
           02  FILLER REDEFINES FNAME07F.
             03 FNAME07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FNAME07I  PIC X(20).
           02  LNAME07L    COMP  PIC  S9(4).
           02  LNAME07F    PICTURE X.
           02  FILLER REDEFINES LNAME07F.
             03 LNAME07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LNAME07I  PIC X(20).
           02  UTYPE07L    COMP  PIC  S9(4).
           02  UTYPE07F    PICTURE X.
           02  FILLER REDEFINES UTYPE07F.
             03 UTYPE07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  UTYPE07I  PIC X(1).
           02  SEL0008L    COMP  PIC  S9(4).
           02  SEL0008F    PICTURE X.
           02  FILLER REDEFINES SEL0008F.
             03 SEL0008A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  SEL0008I  PIC X(1).
           02  USRID08L    COMP  PIC  S9(4).
           02  USRID08F    PICTURE X.
           02  FILLER REDEFINES USRID08F.
             03 USRID08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  USRID08I  PIC X(8).
           02  FNAME08L    COMP  PIC  S9(4).
           02  FNAME08F    PICTURE X.
           02  FILLER REDEFINES FNAME08F.
             03 FNAME08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  FNAME08I  PIC X(20).
           02  LNAME08L    COMP  PIC  S9(4).
           02  LNAME08F    PICTURE X.
           02  FILLER REDEFINES LNAME08F.
             03 LNAME08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  LNAME08I  PIC X(20).
