           02  UTYPE06V    PICTURE X.
           02  UTYPE06O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SEL0007C    PICTURE X.
           02  SEL0007P    PICTURE X.
           02  SEL0007H    PICTURE X.
           02  SEL0007V    PICTURE X.
           02  SEL0007O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  USRID07C    PICTURE X.
           02  USRID07P    PICTURE X.
           02  USRID07H    PICTURE X.
           02  USRID07V    PICTURE X.
           02  USRID07O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FNAME07C    PICTURE X.
           02  FNAME07P    PICTURE X.
           02  FNAME07H    PICTURE X.
           02  FNAME07V    PICTURE X.
           02  FNAME07O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  LNAME07C    PICTURE X.
           02  LNAME07P    PICTURE X.
           02  LNAME07H    PICTURE X.
           02  LNAME07V    PICTURE X.
           02  LNAME07O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  UTYPE07C    PICTURE X.
           02  UTYPE07P    PICTURE X.
           02  UTYPE07H    PICTURE X.
           02  UTYPE07V    PICTURE X.
           02  UTYPE07O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SEL0008C    PICTURE X.
           02  SEL0008P    PICTURE X.
           02  SEL0008H    PICTURE X.
           02  SEL0008V    PICTURE X.
           02  SEL0008O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  USRID08C    PICTURE X.
           02  USRID08P    PICTURE X.
           02  USRID08H    PICTURE X.
           02  USRID08V    PICTURE X.
           02  USRID08O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FNAME08C    PICTURE X.
           02  FNAME08P    PICTURE X.
           02  FNAME08H    PICTURE X.
           02  FNAME08V    PICTURE X.
           02  FNAME08O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  LNAME08C    PICTURE X.
           02  LNAME08P    PICTURE X.
           02  LNAME08H    PICTURE X.
           02  LNAME08V    PICTURE X.
           02  LNAME08O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  UTYPE08C    PICTURE X.
           02  UTYPE08P    PICTURE X.
           02  UTYPE08H    PICTURE X.
           02  UTYPE08V    PICTURE X.
           02  UTYPE08O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SEL0009C    PICTURE X.
           02  SEL0009P    PICTURE X.
           02  SEL0009H    PICTURE X.
           02  SEL0009V    PICTURE X.
           02  SEL0009O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  USRID09C    PICTURE X.
           02  USRID09P    PICTURE X.
           02  USRID09H    PICTURE X.
           02  USRID09V    PICTURE X.
           02  USRID09O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FNAME09C    PICTURE X.
           02  FNAME09P    PICTURE X.
           02  FNAME09H    PICTURE X.
           02  FNAME09V    PICTURE X.
           02  FNAME09O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  LNAME09C    PICTURE X.
           02  LNAME09P    PICTURE X.
           02  LNAME09H    PICTURE X.
           02  LNAME09V    PICTURE X.
           02  LNAME09O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  UTYPE09C    PICTURE X.
           02  UTYPE09P    PICTURE X.
           02  UTYPE09H    PICTURE X.
           02  UTYPE09V    PICTURE X.
           02  UTYPE09O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SEL0010C    PICTURE X.
           02  SEL0010P    PICTURE X.
           02  SEL0010H    PICTURE X.
           02  SEL0010V    PICTURE X.
           02  SEL0010O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  USRID10C    PICTURE X.
