           02  USRID10P    PICTURE X.
           02  USRID10H    PICTURE X.
           02  USRID10V    PICTURE X.
           02  USRID10O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FNAME10C    PICTURE X.
           02  FNAME10P    PICTURE X.
           02  FNAME10H    PICTURE X.
           02  FNAME10V    PICTURE X.
           02  FNAME10O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  LNAME10C    PICTURE X.
           02  LNAME10P    PICTURE X.
           02  LNAME10H    PICTURE X.
           02  LNAME10V    PICTURE X.
           02  LNAME10O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  UTYPE10C    PICTURE X.
           02  UTYPE10P    PICTURE X.
           02  UTYPE10H    PICTURE X.
           02  UTYPE10V    PICTURE X.
           02  UTYPE10O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ERRMSGC    PICTURE X.
           02  ERRMSGP    PICTURE X.
           02  ERRMSGH    PICTURE X.
           02  ERRMSGV    PICTURE X.
           02  ERRMSGO  PIC X(78).
