           02  TITLE02P    PICTURE X.
           02  TITLE02H    PICTURE X.
           02  TITLE02V    PICTURE X.
           02  TITLE02O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURTIMEC    PICTURE X.
           02  CURTIMEP    PICTURE X.
           02  CURTIMEH    PICTURE X.
           02  CURTIMEV    PICTURE X.
           02  CURTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PAGENUMC    PICTURE X.
           02  PAGENUMP    PICTURE X.
           02  PAGENUMH    PICTURE X.
           02  PAGENUMV    PICTURE X.
           02  PAGENUMO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  USRIDINC    PICTURE X.
           02  USRIDINP    PICTURE X.
           02  USRIDINH    PICTURE X.
           02  USRIDINV    PICTURE X.
           02  USRIDINO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  SEL0001C    PICTURE X.
           02  SEL0001P    PICTURE X.
           02  SEL0001H    PICTURE X.
           02  SEL0001V    PICTURE X.
           02  SEL0001O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  USRID01C    PICTURE X.
           02  USRID01P    PICTURE X.
           02  USRID01H    PICTURE X.
           02  USRID01V    PICTURE X.
           02  USRID01O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FNAME01C    PICTURE X.
           02  FNAME01P    PICTURE X.
           02  FNAME01H    PICTURE X.
           02  FNAME01V    PICTURE X.
           02  FNAME01O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  LNAME01C    PICTURE X.
           02  LNAME01P    PICTURE X.
           02  LNAME01H    PICTURE X.
           02  LNAME01V    PICTURE X.
           02  LNAME01O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  UTYPE01C    PICTURE X.
           02  UTYPE01P    PICTURE X.
           02  UTYPE01H    PICTURE X.
           02  UTYPE01V    PICTURE X.
           02  UTYPE01O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SEL0002C    PICTURE X.
           02  SEL0002P    PICTURE X.
           02  SEL0002H    PICTURE X.
           02  SEL0002V    PICTURE X.
           02  SEL0002O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  USRID02C    PICTURE X.
           02  USRID02P    PICTURE X.
           02  USRID02H    PICTURE X.
           02  USRID02V    PICTURE X.
           02  USRID02O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FNAME02C    PICTURE X.
           02  FNAME02P    PICTURE X.
           02  FNAME02H    PICTURE X.
           02  FNAME02V    PICTURE X.
           02  FNAME02O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  LNAME02C    PICTURE X.
           02  LNAME02P    PICTURE X.
           02  LNAME02H    PICTURE X.
           02  LNAME02V    PICTURE X.
           02  LNAME02O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  UTYPE02C    PICTURE X.
           02  UTYPE02P    PICTURE X.
           02  UTYPE02H    PICTURE X.
           02  UTYPE02V    PICTURE X.
           02  UTYPE02O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SEL0003C    PICTURE X.
           02  SEL0003P    PICTURE X.
           02  SEL0003H    PICTURE X.
           02  SEL0003V    PICTURE X.
           02  SEL0003O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  USRID03C    PICTURE X.
           02  USRID03P    PICTURE X.
           02  USRID03H    PICTURE X.
           02  USRID03V    PICTURE X.
           02  USRID03O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FNAME03C    PICTURE X.
           02  FNAME03P    PICTURE X.
           02  FNAME03H    PICTURE X.
           02  FNAME03V    PICTURE X.
           02  FNAME03O  PIC X(20).
