           02  FILLER PICTURE X(3).
           02  LNAME03C    PICTURE X.
           02  LNAME03P    PICTURE X.
           02  LNAME03H    PICTURE X.
           02  LNAME03V    PICTURE X.
           02  LNAME03O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  UTYPE03C    PICTURE X.
           02  UTYPE03P    PICTURE X.
           02  UTYPE03H    PICTURE X.
           02  UTYPE03V    PICTURE X.
           02  UTYPE03O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SEL0004C    PICTURE X.
           02  SEL0004P    PICTURE X.
           02  SEL0004H    PICTURE X.
           02  SEL0004V    PICTURE X.
           02  SEL0004O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  USRID04C    PICTURE X.
           02  USRID04P    PICTURE X.
           02  USRID04H    PICTURE X.
           02  USRID04V    PICTURE X.
           02  USRID04O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FNAME04C    PICTURE X.
           02  FNAME04P    PICTURE X.
           02  FNAME04H    PICTURE X.
           02  FNAME04V    PICTURE X.
           02  FNAME04O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  LNAME04C    PICTURE X.
           02  LNAME04P    PICTURE X.
           02  LNAME04H    PICTURE X.
           02  LNAME04V    PICTURE X.
           02  LNAME04O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  UTYPE04C    PICTURE X.
           02  UTYPE04P    PICTURE X.
           02  UTYPE04H    PICTURE X.
           02  UTYPE04V    PICTURE X.
           02  UTYPE04O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SEL0005C    PICTURE X.
           02  SEL0005P    PICTURE X.
           02  SEL0005H    PICTURE X.
           02  SEL0005V    PICTURE X.
           02  SEL0005O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  USRID05C    PICTURE X.
           02  USRID05P    PICTURE X.
           02  USRID05H    PICTURE X.
           02  USRID05V    PICTURE X.
           02  USRID05O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FNAME05C    PICTURE X.
           02  FNAME05P    PICTURE X.
           02  FNAME05H    PICTURE X.
           02  FNAME05V    PICTURE X.
           02  FNAME05O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  LNAME05C    PICTURE X.
           02  LNAME05P    PICTURE X.
           02  LNAME05H    PICTURE X.
           02  LNAME05V    PICTURE X.
           02  LNAME05O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  UTYPE05C    PICTURE X.
           02  UTYPE05P    PICTURE X.
           02  UTYPE05H    PICTURE X.
           02  UTYPE05V    PICTURE X.
           02  UTYPE05O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  SEL0006C    PICTURE X.
           02  SEL0006P    PICTURE X.
           02  SEL0006H    PICTURE X.
           02  SEL0006V    PICTURE X.
           02  SEL0006O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  USRID06C    PICTURE X.
           02  USRID06P    PICTURE X.
           02  USRID06H    PICTURE X.
           02  USRID06V    PICTURE X.
           02  USRID06O  PIC X(8).
           02  FILLER PICTURE X(3).
           02  FNAME06C    PICTURE X.
           02  FNAME06P    PICTURE X.
           02  FNAME06H    PICTURE X.
           02  FNAME06V    PICTURE X.
           02  FNAME06O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  LNAME06C    PICTURE X.
           02  LNAME06P    PICTURE X.
           02  LNAME06H    PICTURE X.
           02  LNAME06V    PICTURE X.
           02  LNAME06O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  UTYPE06C    PICTURE X.
           02  UTYPE06P    PICTURE X.
           02  UTYPE06H    PICTURE X.
