         PRINT NOGEN
EIADM01  DFHMSD TYPE=&SYSPARM,LANG=COBOL,MODE=INOUT,                  X
               STORAGE=AUTO,CTRL=FREEKB,TIOAPFX=YES,TERM=3270-2
EIADM0A  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(01,01),LENGTH=20,                                 X
               ATTRB=(ASKIP,BRT),                                      X
               INITIAL='ECI RETAIL - ADMIN  '
         DFHMDF POS=(03,20),LENGTH=40,                                 X
               ATTRB=(ASKIP,BRT),                                      X
               INITIAL='MENU ADMINISTRACION - ECI'
         DFHMDF POS=(06,10),LENGTH=50,ATTRB=(ASKIP),                   X
               INITIAL='UL - Listar Usuarios'
         DFHMDF POS=(07,10),LENGTH=50,ATTRB=(ASKIP),                   X
               INITIAL='UA - Anadir Usuario'
         DFHMDF POS=(08,10),LENGTH=50,ATTRB=(ASKIP),                   X
               INITIAL='UM - Modificar Usuario'
         DFHMDF POS=(09,10),LENGTH=50,ATTRB=(ASKIP),                   X
               INITIAL='UE - Eliminar Usuario'
         DFHMDF POS=(12,10),LENGTH=10,ATTRB=(ASKIP),                   X
               INITIAL='Opcion => '
OPTIONL  DFHMDF POS=(12,21),LENGTH=02,ATTRB=(UNPROT,IC)
         DFHMDF POS=(12,24),LENGTH=01,ATTRB=ASKIP
ERRMSG   DFHMDF POS=(20,02),LENGTH=78,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(23,01),LENGTH=40,ATTRB=(ASKIP),                   X
               INITIAL='PF3=Cerrar Sesion  ENTER=Seleccionar'
         DFHMSD TYPE=FINAL
         END
