         PRINT NOGEN
EISGN00  DFHMSD TYPE=&SYSPARM,LANG=COBOL,MODE=INOUT,                  X
               STORAGE=AUTO,CTRL=FREEKB,TIOAPFX=YES,TERM=3270-2
EISGN0A  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(01,01),LENGTH=20,                                 X
               ATTRB=(ASKIP,BRT),                                      X
               INITIAL='ECI RETAIL - PdV    '
         DFHMDF POS=(01,60),LENGTH=10,ATTRB=(ASKIP),                   X
               INITIAL='DD/MM/AAAA'
         DFHMDF POS=(03,25),LENGTH=30,                                 X
               ATTRB=(ASKIP,BRT),                                      X
               INITIAL='SISTEMA PUNTO DE VENTA ECI'
         DFHMDF POS=(05,25),LENGTH=30,                                 X
               ATTRB=(ASKIP),                                          X
               INITIAL='El Corte Ingles - Login'
         DFHMDF POS=(08,20),LENGTH=10,ATTRB=(ASKIP),                   X
               INITIAL='Usuario:  '
USERIDL  DFHMDF POS=(08,31),LENGTH=08,ATTRB=(UNPROT,IC)
         DFHMDF POS=(08,40),LENGTH=01,ATTRB=ASKIP
         DFHMDF POS=(10,20),LENGTH=10,ATTRB=(ASKIP),                   X
               INITIAL='Clave:    '
PASSWDL  DFHMDF POS=(10,31),LENGTH=08,ATTRB=(UNPROT,DRK)
         DFHMDF POS=(10,40),LENGTH=01,ATTRB=ASKIP
ERRMSG   DFHMDF POS=(14,02),LENGTH=78,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(23,01),LENGTH=40,ATTRB=(ASKIP),                   X
               INITIAL='PF3=Salir  ENTER=Acceder'
         DFHMSD TYPE=FINAL
         END
