         PRINT NOGEN
EIUSR00  DFHMSD TYPE=&SYSPARM,LANG=COBOL,MODE=INOUT,                  X
               STORAGE=AUTO,CTRL=FREEKB,TIOAPFX=YES,TERM=3270-2
EIUSR0A  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(01,01),LENGTH=40,                                 X
               ATTRB=(ASKIP,BRT),                                      X
               INITIAL='ECI RETAIL - Listado Usuarios'
         DFHMDF POS=(03,02),LENGTH=76,ATTRB=(ASKIP,BRT),               X
               INITIAL='ID       Nombre              Apellido      X
               '           Tipo Centro'
ERRMSG   DFHMDF POS=(20,02),LENGTH=78,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(23,01),LENGTH=40,ATTRB=(ASKIP),                   X
               INITIAL='PF3=Menu Admin  PF7=Anterior  PF8=Sig.'
         DFHMSD TYPE=FINAL
         END
