         PRINT NOGEN
EIUSR03  DFHMSD TYPE=&SYSPARM,LANG=COBOL,MODE=INOUT,                  X
               STORAGE=AUTO,CTRL=FREEKB,TIOAPFX=YES,TERM=3270-2
EIUSR3A  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(01,01),LENGTH=40,                                 X
               ATTRB=(ASKIP,BRT),                                      X
               INITIAL='ECI RETAIL - Eliminar Usuario'
         DFHMDF POS=(04,05),LENGTH=12,ATTRB=(ASKIP),                   X
               INITIAL='ID Usuario: '
USRIDF   DFHMDF POS=(04,18),LENGTH=08,ATTRB=(UNPROT,IC)
         DFHMDF POS=(06,05),LENGTH=50,ATTRB=(ASKIP,BRT),               X
               INITIAL='Confirme con ENTER para eliminar'
ERRMSG   DFHMDF POS=(20,02),LENGTH=78,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(23,01),LENGTH=40,ATTRB=(ASKIP),                   X
               INITIAL='PF3=Menu Admin  ENTER=Confirmar'
         DFHMSD TYPE=FINAL
         END
