      *****************************************************************
      *    Data-structure for Tipo de producto (RECLN = 60)
      *    Equivalente a TRANTYPE
      *****************************************************************
       01  PROD-TIPO-RECORD.
           05  PROD-TIPO                               PIC X(02).
           05  PROD-TIPO-DESC                          PIC X(50).
           05  FILLER                                  PIC X(08).
      *
      * Ver: ECIRetail_v1.0 Date: 2024-01-15
      *
