      *****************************************************************
      *    Title line for BMS maps
      *****************************************************************
       01  ECI-TITLE-LINE.
           05  ECI-TITLE-APP-NAME              PIC X(20) VALUE
               'ECI Retail - PdV'.
           05  FILLER                          PIC X(20) VALUE SPACES.
           05  ECI-TITLE-TXN-NAME              PIC X(10) VALUE SPACES.
           05  FILLER                          PIC X(10) VALUE SPACES.
           05  ECI-TITLE-DATE                  PIC X(10) VALUE SPACES.
           05  FILLER                          PIC X(05) VALUE SPACES.
           05  ECI-TITLE-TIME                  PIC X(05) VALUE SPACES.
      *
      * Ver: ECIRetail_v1.0 Date: 2024-01-15
      *
