      *****************************************************************
      *    Data-structure for Tarjeta-Cliente-Centro xref (RECLN 50)
      *****************************************************************
       01 TARJ-XREF-RECORD.
           05  XREF-TARJ-NUM                     PIC X(16).
           05  XREF-CLI-ID                       PIC 9(09).
           05  XREF-CENTRO-ID                    PIC 9(05).
           05  FILLER                            PIC X(20).
      *
      * Ver: ECIRetail_v1.0 Date: 2024-01-15
      *
